{
"id": "48",
"answertype": "string",
"aggregation": "false",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "What was the first name of the band Queens of the Stone Age?",
"keywords": "first name, Queens of the Stone Age"
},{
"language": "fa",
"string": "",
"keywords": ""
},{
"language": "de",
"string": "Was war der erste Name der Band Queens of the Stone Age?",
"keywords": "erste Name, Queens of the Stone Age"
},{
"language": "es",
"string": "",
"keywords": ""
},{
"language": "it",
"string": "Qual è stato il primo nome del gruppo Queens of the Stone Age?",
"keywords": "primo nome, Queens of the Stone Age"
},{
"language": "fr",
"string": "Quel était le premier nom du groupe Queens of the Stone Age?",
"keywords": "premier nom, Queens of the Stone Age"
},{
"language": "nl",
"string": "",
"keywords": ""
},{
"language": "ro",
"string": "",
"keywords": ""
}
],
"query":{
"sparql": "PREFIX res: <http://dbpedia.org/resource/> PREFIX dbo: <http://dbpedia.org/ontology/> select distinct ?name where { res:Queens_of_the_Stone_Age dbo:alias ?name . }"
},
"answers": [
{
"head": {
"vars": [
"name"
]
},
"results": {
"bindings": [
{
"name": {
"type": "literal",
"value": "Gamma Ray (1996–1997)"
}
}
]
}
}
]
}
,


