LemonEntry,partOfSpeech,writtenForm (singular),writtenForm (plural),preposition,SyntacticFrame,copulativeArg,prepositionalAdjunct,sense,reference,domain,range,GrammarRule1:question1,SPARQL,GrammarRule1: question2,SPARQL Question 2,GrammarRule 1: questions,SPARQL ,NP (Grammar Rule 2),,grammar rules,numberOfQuestions
gross-of,noun,gross,-,of,NounPPFrame,range,domain,1,dbo:gross,dbo:Film,xsd:double,"What (xsd:double, X) is the gross/- of (dbo:Film,Y?) ",SELECT ?X WHERE { Y dbo:gross ?X.},FALSE,FALSE,"List the (xsd:double, X) - of (dbo:Film,Y?) ",SELECT ?X WHERE { Y dbo:gross ?X.},"the gross of (dbo:Film,Y) ",,2,
productionCompany-of,noun,production company,production companies,of,NounPPFrame,range,domain,1,dbo:productionCompany,dbo:Work,dbo:Company,"What (dbo:Company, X) is the production company/production companies of (dbo:Work,Y?) ",SELECT ?X WHERE { Y dbo:productionCompany ?X.},FALSE,FALSE,"List the (dbo:Company, X) production companies of (dbo:Work,Y?) ",SELECT ?X WHERE { Y dbo:productionCompany ?X.},"the production company of (dbo:Work,Y) ",,2,
length-of,noun,length,-,of,NounPPFrame,range,domain,1,dbo:length,dbo:River,xsd:double,"What (xsd:double, X) is the length/- of (dbo:River,Y?) ",SELECT ?X WHERE { Y dbo:length ?X.},FALSE,FALSE,"List the (xsd:double, X) - of (dbo:River,Y?) ",SELECT ?X WHERE { Y dbo:length ?X.},"the length of (dbo:River,Y) ",,2,
areaTotal-of,noun,total area,-,of,NounPPFrame,range,domain,1,dbo:areaTotal,dbo:Place,xsd:double,"What (xsd:double, X) is the total area/- of (dbo:Place,Y?) ",SELECT ?X WHERE { Y dbo:areaTotal ?X.},FALSE,FALSE,"List the (xsd:double, X) - of (dbo:Place,Y?) ",SELECT ?X WHERE { Y dbo:areaTotal ?X.},"the total area of (dbo:Place,Y) ",,2,
governingBody-of,noun,governing body,governing bodies,of,NounPPFrame,range,domain,1,dbo:governingBody,dbo:Place,dbo:Organisation,"What (dbo:Organisation, X) is the governing body/governing bodies of (dbo:Place,Y?) ",SELECT ?X WHERE { Y dbo:governingBody ?X.},FALSE,FALSE,"List the (dbo:Organisation, X) governing bodies of (dbo:Place,Y?) ",SELECT ?X WHERE { Y dbo:governingBody ?X.},"the governing body of (dbo:Place,Y) ",,2,
elevation-of,noun,elevation,-,of,NounPPFrame,range,domain,1,dbo:elevation,dbo:Place,xsd:double,"What (xsd:double, X) is the elevation/- of (dbo:Place,Y?) ",SELECT ?X WHERE { Y dbo:elevation ?X.},FALSE,FALSE,"List the (xsd:double, X) - of (dbo:Place,Y?) ",SELECT ?X WHERE { Y dbo:elevation ?X.},"the elevation of (dbo:Place,Y) ",,2,
populationMetro-of,noun,population metro,population metros,of,NounPPFrame,range,domain,1,dbo:populationMetro,dbo:PopulatedPlace,xsd:nonNegativeInteger,"What (xsd:nonNegativeInteger, X) is the population metro/population metros of (dbo:PopulatedPlace,Y?) ",SELECT ?X WHERE { Y dbo:populationMetro ?X.},FALSE,FALSE,"List the (xsd:nonNegativeInteger, X) population metros of (dbo:PopulatedPlace,Y?) ",SELECT ?X WHERE { Y dbo:populationMetro ?X.},"the population metro of (dbo:PopulatedPlace,Y) ",,2,
areaUrban-of,noun,urban area,urban areas,of,NounPPFrame,range,domain,1,dbo:areaUrban,dbo:PopulatedPlace,xsd:double,"What (xsd:double, X) is the urban area/urban areas of (dbo:PopulatedPlace,Y?) ",SELECT ?X WHERE { Y dbo:areaUrban ?X.},FALSE,FALSE,"List the (xsd:double, X) urban areas of (dbo:PopulatedPlace,Y?) ",SELECT ?X WHERE { Y dbo:areaUrban ?X.},"the urban area of (dbo:PopulatedPlace,Y) ",,2,
populationDensity-of,noun,population density,-,of,NounPPFrame,range,domain,1,dbo:populationDensity,dbo:PopulatedPlace,xsd:double,"What (xsd:double, X) is the population density/- of (dbo:PopulatedPlace,Y?) ",SELECT ?X WHERE { Y dbo:populationDensity ?X.},FALSE,FALSE,"List the (xsd:double, X) - of (dbo:PopulatedPlace,Y?) ",SELECT ?X WHERE { Y dbo:populationDensity ?X.},"the population density of (dbo:PopulatedPlace,Y) ",,2,
populationTotalRanking_of,noun,total population ranking,-,of,NounPPFrame,range,domain,1,dbo:populationTotalRanking,dbo:PopulatedPlace,xsd:positiveInteger,"What (xsd:positiveInteger, X) is the total population ranking/- of (dbo:PopulatedPlace,Y?) ",SELECT ?X WHERE { Y dbo:populationTotalRanking ?X.},FALSE,FALSE,"List the (xsd:positiveInteger, X) - of (dbo:PopulatedPlace,Y?) ",SELECT ?X WHERE { Y dbo:populationTotalRanking ?X.},"the total population ranking of (dbo:PopulatedPlace,Y) ",,2,
soundRecording-of,noun,sound recording,sound recordings,of,NounPPFrame,range,domain,1,dbo:soundRecording,dbo:Work,dbo:Sound,"What (dbo:Sound, X) is the sound recording/sound recordings of (dbo:Work,Y?) ",SELECT ?X WHERE { Y dbo:soundRecording ?X.},FALSE,FALSE,"List the (dbo:Sound, X) sound recordings of (dbo:Work,Y?) ",SELECT ?X WHERE { Y dbo:soundRecording ?X.},"the sound recording of (dbo:Work,Y) ",,2,
originalName-of,noun,original name,-,of,NounPPFrame,range,domain,1,dbo:originalName ,dbo:Person,http://www.w3.org/2001/XMLSchema#string,"What (http://www.w3.org/2001/XMLSchema#string, X) is the original name/- of (dbo:Person,Y?) ",SELECT ?X WHERE { Y dbo:originalName  ?X.},FALSE,FALSE,"List the (http://www.w3.org/2001/XMLSchema#string, X) - of (dbo:Person,Y?) ",SELECT ?X WHERE { Y dbo:originalName  ?X.},"the original name of (dbo:Person,Y) ",,2,
netIncome-of,noun,net Income,net incomes,of,NounPPFrame,range,domain,1,dbo:netIncome,dbo:Company,xsd:double,"What (xsd:double, X) is the net Income/net incomes of (dbo:Company,Y?) ",SELECT ?X WHERE { Y dbo:netIncome ?X.},FALSE,FALSE,"List the (xsd:double, X) net incomes of (dbo:Company,Y?) ",SELECT ?X WHERE { Y dbo:netIncome ?X.},"the net Income of (dbo:Company,Y) ",,2,
citizenship-of,noun,citizenship,citizenships,of,NounPPFrame,range,domain,1,dbo:citizenship,dbo:Person,dbo:Location,"What (dbo:Location, X) is the citizenship/citizenships of (dbo:Person,Y?) ",SELECT ?X WHERE { Y dbo:citizenship ?X.},FALSE,FALSE,"List the (dbo:Location, X) citizenships of (dbo:Person,Y?) ",SELECT ?X WHERE { Y dbo:citizenship ?X.},"the citizenship of (dbo:Person,Y) ",,2,
deathCause-of,noun,death cause,death causes,of,NounPPFrame,range,domain,1,dbo:deathCause,dbo:Person,dbo:disease,"What (dbo:disease, X) is the death cause/death causes of (dbo:Person,Y?) ",SELECT ?X WHERE { Y dbo:deathCause ?X.},FALSE,FALSE,"List the (dbo:disease, X) death causes of (dbo:Person,Y?) ",SELECT ?X WHERE { Y dbo:deathCause ?X.},"the death cause of (dbo:Person,Y) ",,2,
signature-of,noun,signature,-,of,NounPPFrame,range,domain,1,dbo:signature,dbo:Person,xsd:string,"What (xsd:string, X) is the signature/- of (dbo:Person,Y?) ",SELECT ?X WHERE { Y dbo:signature ?X.},FALSE,FALSE,"List the (xsd:string, X) - of (dbo:Person,Y?) ",SELECT ?X WHERE { Y dbo:signature ?X.},"the signature of (dbo:Person,Y) ",,2,
profession-of,noun,profession,professions,of,NounPPFrame,range,domain,1,dbo:profession,dbo:Person,dbo:PersonFunction,"What (dbo:PersonFunction, X) is the profession/professions of (dbo:Person,Y?) ",SELECT ?X WHERE { Y dbo:profession ?X.},FALSE,FALSE,"List the (dbo:PersonFunction, X) professions of (dbo:Person,Y?) ",SELECT ?X WHERE { Y dbo:profession ?X.},"the profession of (dbo:Person,Y) ",,2,
recordLabel-of,noun,record label,record labels,of,NounPPFrame,range,domain,1,dbo:recordLabel,dbo:Work,dbo:RecordLabel,"What (dbo:RecordLabel, X) is the record label/record labels of (dbo:Work,Y?) ",SELECT ?X WHERE { Y dbo:recordLabel ?X.},FALSE,FALSE,"List the (dbo:RecordLabel, X) record labels of (dbo:Work,Y?) ",SELECT ?X WHERE { Y dbo:recordLabel ?X.},"the record label of (dbo:Work,Y) ",,2,
previousWork-of,noun,previous work,previous works,of,NounPPFrame,range,domain,1,dbo:previousWork,dbo:Work,dbo:Work,"What (dbo:Work, X) is the previous work/previous works of (dbo:Work,Y?) ",SELECT ?X WHERE { Y dbo:previousWork ?X.},FALSE,FALSE,"List the (dbo:Work, X) previous works of (dbo:Work,Y?) ",SELECT ?X WHERE { Y dbo:previousWork ?X.},"the previous work of (dbo:Work,Y) ",,2,
subsequentWork-of,noun,subsequent work,-,of,NounPPFrame,range,domain,1,dbo:subsequentWork,dbo:Work,dbo:Work,"What (dbo:Work, X) is the subsequent work/- of (dbo:Work,Y?) ",SELECT ?X WHERE { Y dbo:subsequentWork ?X.},FALSE,FALSE,"List the (dbo:Work, X) - of (dbo:Work,Y?) ",SELECT ?X WHERE { Y dbo:subsequentWork ?X.},"the subsequent work of (dbo:Work,Y) ",,2,
wife-of,noun,wife,wives,of,NounPPFrame,range,domain,1,dbo:spouse,dbo:Person,dbo:Person,-,SELECT ?X WHERE { Y dbo:spouse ?X.},"Which person,Who (dbo:Person, X) is,was the wife of (dbo:Person,Y?) (X dbo:spouse Y)",SELECT ?X WHERE { Y dbo:spouse ?X.},"List the (dbo:Person, X) wives of (dbo:Person,Y?) ",SELECT ?X WHERE { Y dbo:spouse ?X.},"the wife of (dbo:Person,Y) ",,2,
producer-of,noun,producer,producers,of,NounPPFrame,range,domain,1,dbo:producer,dbo:Film,dbo:Person,-,SELECT ?X WHERE { Y dbo:producer ?X.},"Which person,Who (dbo:Person, X) is,was the producer of (dbo:Film,Y?) (X dbo:producer Y)",SELECT ?X WHERE { Y dbo:producer ?X.},"List the (dbo:Person, X) producers of (dbo:Film,Y?) ",SELECT ?X WHERE { Y dbo:producer ?X.},"the producer of (dbo:Film,Y) ",,2,
narrator-of,noun,narrator,narrators,of,NounPPFrame,range,domain,1,dbo:narrator,dbo:Work,dbo:Person,-,SELECT ?X WHERE { Y dbo:narrator ?X.},"Which person,Who (dbo:Person, X) is,was the narrator of (dbo:Work,Y?) (X dbo:narrator Y)",SELECT ?X WHERE { Y dbo:narrator ?X.},"List the (dbo:Person, X) narrators of (dbo:Work,Y?) ",SELECT ?X WHERE { Y dbo:narrator ?X.},"the narrator of (dbo:Work,Y) ",,2,
portrayer-of,noun,portrayer,portrayers,of,NounPPFrame,range,domain,1,dbo:portrayer,dbo:FictionalCharacter,dbo:Person,-,SELECT ?X WHERE { Y dbo:portrayer ?X.},"Which person,Who (dbo:Person, X) is,was the portrayer of (dbo:FictionalCharacter,Y?) (X dbo:portrayer Y)",SELECT ?X WHERE { Y dbo:portrayer ?X.},"List the (dbo:Person, X) portrayers of (dbo:FictionalCharacter,Y?) ",SELECT ?X WHERE { Y dbo:portrayer ?X.},"the portrayer of (dbo:FictionalCharacter,Y) ",,2,
stateOfOrigin-of,noun,origin,-,of,NounPPFrame,range,domain,1,dbo:stateOfOrigin,dbo:Person,dbo:Country,"What (dbo:Country, X) is the origin/- of (dbo:Person,Y?) ",SELECT ?X WHERE { Y dbo:stateOfOrigin ?X.},FALSE,FALSE,"List the (dbo:Country, X) - of (dbo:Person,Y?) ",SELECT ?X WHERE { Y dbo:stateOfOrigin ?X.},"the origin of (dbo:Person,Y) ",,2,
mostKnownWorks-of,noun,most known work,-,of,NounPPFrame,range,domain,1,dbo:knownFor,dbo:Person,dbo:Work,"What (dbo:Work, X) is the most known work/- of (dbo:Person,Y?) ",SELECT ?X WHERE { Y dbo:knownFor ?X.},FALSE,FALSE,"List the (dbo:Work, X) - of (dbo:Person,Y?) ",SELECT ?X WHERE { Y dbo:knownFor ?X.},"the most known work of (dbo:Person,Y) ",,2,
runtimeSeconds-of,noun,runtime in seconds,-,of,NounPPFrame,range,domain,1,dbo:runtime,dbo:Work,xsd:double,"What (xsd:double, X) is the runtime in seconds/- of (dbo:Work,Y?) ",SELECT ?X WHERE { Y dbo:runtime ?X.},FALSE,FALSE,"List the (xsd:double, X) - of (dbo:Work,Y?) ",SELECT ?X WHERE { Y dbo:runtime ?X.},"the runtime in seconds of (dbo:Work,Y) ",,2,
writer-of,noun,writer,-,of,NounPPFrame,range,domain,1,dbo:writer,dbo:Work,dbo:Person,"What (dbo:Person, X) is the writer/- of (dbo:Work,Y?) ",SELECT ?X WHERE { Y dbo:writer ?X.},"Which person,Who (dbo:Person, X) is,was the writer of (dbo:Work,Y?) (X dbo:writer Y)",SELECT ?X WHERE { Y dbo:writer ?X.},"List the (dbo:Person, X) - of (dbo:Work,Y?) ",SELECT ?X WHERE { Y dbo:writer ?X.},"the writer of (dbo:Work,Y) ",,2,
-,noun,predecessor,predecessors,of,NounPPFrame,range,domain,2,dbo:predecessor,dbo:Company,dbo:Company,"What (dbo:Company, X) is the predecessor/predecessors of (dbo:Company,Y?) ",SELECT ?X WHERE { Y dbo:predecessor ?X.},FALSE,FALSE,"List the (dbo:Company, X) predecessors of (dbo:Company,Y?) ",SELECT ?X WHERE { Y dbo:predecessor ?X.},"the predecessor of (dbo:Company,Y) ",,2,
foundingDate-of,noun,founding date ,-,of,NounPPFrame,range,domain,1,dbo:foundingDate,dbo:Organisation,xsd:date,"What (xsd:date, X) is the founding date /- of (dbo:Organisation,Y?) ",SELECT ?X WHERE { Y dbo:foundingDate ?X.},FALSE,FALSE,"List the (xsd:date, X) - of (dbo:Organisation,Y?) ",SELECT ?X WHERE { Y dbo:foundingDate ?X.},"the founding date  of (dbo:Organisation,Y) ",,2,
numberOfEmployees,noun,number of employees,-,of ,NounPPFrame,range,domain,1,dbo:numberOfEmployees,dbo:Organisation,xsd:nonNegativeInteger,"What (xsd:nonNegativeInteger, X) is the number of employees/- of  (dbo:Organisation,Y?) ",SELECT ?X WHERE { Y dbo:numberOfEmployees ?X.},FALSE,FALSE,"List the (xsd:nonNegativeInteger, X) - of  (dbo:Organisation,Y?) ",SELECT ?X WHERE { Y dbo:numberOfEmployees ?X.},"the number of employees of  (dbo:Organisation,Y) ",,2,
operatingIncome-of,noun,operating income,-,of,NounPPFrame,range,domain,1,dbo:operatingIncome,dbo:Company,xsd:double,"What (xsd:double, X) is the operating income/- of (dbo:Company,Y?) ",SELECT ?X WHERE { Y dbo:operatingIncome ?X.},FALSE,FALSE,"List the (xsd:double, X) - of (dbo:Company,Y?) ",SELECT ?X WHERE { Y dbo:operatingIncome ?X.},"the operating income of (dbo:Company,Y) ",,2,
area-in-m²-of,noun,area in m²,areas in m²,of,NounPPFrame,range,domain,1,dbo:area,dbo:Place,xsd:double,"What (xsd:double, X) is the area in m²/areas in m² of (dbo:Place,Y?) ",SELECT ?X WHERE { Y dbo:area ?X.},FALSE,FALSE,"List the (xsd:double, X) areas in m² of (dbo:Place,Y?) ",SELECT ?X WHERE { Y dbo:area ?X.},"the area in m² of (dbo:Place,Y) ",,2,
foundingYear-of,noun,founding year,-,of,NounPPFrame,range,domain,1,dbo:foundingYear,dbo:Country,xsd:gYear,"What (xsd:gYear, X) is the founding year/- of (dbo:Country,Y?) ",SELECT ?X WHERE { Y dbo:foundingYear ?X.},FALSE,FALSE,"List the (xsd:gYear, X) - of (dbo:Country,Y?) ",SELECT ?X WHERE { Y dbo:foundingYear ?X.},"the founding year of (dbo:Country,Y) ",,2,
endowment-of,noun,endowment,-,of,NounPPFrame,range,domain,1,dbo:endowment,dbo:Organisation,xsd:double,"What (xsd:double, X) is the endowment/- of (dbo:Organisation,Y?) ",SELECT ?X WHERE { Y dbo:endowment ?X.},FALSE,FALSE,"List the (xsd:double, X) - of (dbo:Organisation,Y?) ",SELECT ?X WHERE { Y dbo:endowment ?X.},"the endowment of (dbo:Organisation,Y) ",,2,
area-of,noun,area,-,of,NounPPFrame,range,domain,1,dbo:area,dbo:Organisation,xsd:double,"What (xsd:double, X) is the area/- of (dbo:Organisation,Y?) ",SELECT ?X WHERE { Y dbo:area ?X.},FALSE,FALSE,"List the (xsd:double, X) - of (dbo:Organisation,Y?) ",SELECT ?X WHERE { Y dbo:area ?X.},"the area of (dbo:Organisation,Y) ",,2,
networth-of,noun,networth,-,of,NounPPFrame,range,domain,1,dbo:networth,dbo:Person,xsd:double,"What (xsd:double, X) is the networth/- of (dbo:Person,Y?) ",SELECT ?X WHERE { Y dbo:networth ?X.},FALSE,FALSE,"List the (xsd:double, X) - of (dbo:Person,Y?) ",SELECT ?X WHERE { Y dbo:networth ?X.},"the networth of (dbo:Person,Y) ",,2,
parent-of,noun,parent,parents,of,NounPPFrame,range,domain,1,dbo:parent,dbo:Person,dbo:Person,"What (dbo:Person, X) is the parent/parents of (dbo:Person,Y?) ",SELECT ?X WHERE { Y dbo:parent ?X.},"Which person,Who (dbo:Person, X) is,was the parent of (dbo:Person,Y?) (X dbo:parent Y)",SELECT ?X WHERE { Y dbo:parent ?X.},"List the (dbo:Person, X) parents of (dbo:Person,Y?) ",SELECT ?X WHERE { Y dbo:parent ?X.},"the parent of (dbo:Person,Y) ",,2,
averageDepth-of,noun,average depth,-,of,NounPPFrame,range,domain,1,dbo:averageDepth,dbo:Place,xsd:double,"What (xsd:double, X) is the average depth/- of (dbo:Place,Y?) ",SELECT ?X WHERE { Y dbo:averageDepth ?X.},FALSE,FALSE,"List the (xsd:double, X) - of (dbo:Place,Y?) ",SELECT ?X WHERE { Y dbo:averageDepth ?X.},"the average depth of (dbo:Place,Y) ",,2,
maximumDepth-of,noun,maximum depth,-,of,NounPPFrame,range,domain,1,dbo:maximumDepth,dbo:Place,xsd:double,"What (xsd:double, X) is the maximum depth/- of (dbo:Place,Y?) ",SELECT ?X WHERE { Y dbo:maximumDepth ?X.},FALSE,FALSE,"List the (xsd:double, X) - of (dbo:Place,Y?) ",SELECT ?X WHERE { Y dbo:maximumDepth ?X.},"the maximum depth of (dbo:Place,Y) ",,2,
shoreLength-of,noun,shore length,-,of,NounPPFrame,range,domain,1,dbo:shoreLength,dbo:BodyOfWater,xsd:double,"What (xsd:double, X) is the shore length/- of (dbo:BodyOfWater,Y?) ",SELECT ?X WHERE { Y dbo:shoreLength ?X.},FALSE,FALSE,"List the (xsd:double, X) - of (dbo:BodyOfWater,Y?) ",SELECT ?X WHERE { Y dbo:shoreLength ?X.},"the shore length of (dbo:BodyOfWater,Y) ",,2,
volume-of,noun,volume,-,of,NounPPFrame,range,domain,1,dbo:volume,dbo:BodyOfWater,xsd:double,"What (xsd:double, X) is the volume/- of (dbo:BodyOfWater,Y?) ",SELECT ?X WHERE { Y dbo:volume ?X.},FALSE,FALSE,"List the (xsd:double, X) - of (dbo:BodyOfWater,Y?) ",SELECT ?X WHERE { Y dbo:volume ?X.},"the volume of (dbo:BodyOfWater,Y) ",,2,
width-of,noun,width,-,of,NounPPFrame,range,domain,1,dbo:width,dbo:BodyOfWater,xsd:double,"What (xsd:double, X) is the width/- of (dbo:BodyOfWater,Y?) ",SELECT ?X WHERE { Y dbo:width ?X.},FALSE,FALSE,"List the (xsd:double, X) - of (dbo:BodyOfWater,Y?) ",SELECT ?X WHERE { Y dbo:width ?X.},"the width of (dbo:BodyOfWater,Y) ",,2,
parentCompany-of,noun,parent company,parent companies,of,NounPPFrame,range,domain,1,dbo:parentCompany,dbo:Company,dbo:Company,"What (dbo:Company, X) is the parent company/parent companies of (dbo:Company,Y?) ",SELECT ?X WHERE { Y dbo:parentCompany ?X.},FALSE,FALSE,"List the (dbo:Company, X) parent companies of (dbo:Company,Y?) ",SELECT ?X WHERE { Y dbo:parentCompany ?X.},"the parent company of (dbo:Company,Y) ",,2,
service-of,noun,service,services,of,NounPPFrame,range,domain,1,dbo:service,dbo:Organisation,dbo:PersonFunction,"What (dbo:PersonFunction, X) is the service/services of (dbo:Organisation,Y?) ",SELECT ?X WHERE { Y dbo:service ?X.},FALSE,FALSE,"List the (dbo:PersonFunction, X) services of (dbo:Organisation,Y?) ",SELECT ?X WHERE { Y dbo:service ?X.},"the service of (dbo:Organisation,Y) ",,2,
movie-of,noun,movie,movies,of,NounPPFrame,range,domain,1,dbo:Person,dbo:Person,dbo:Work,"What (dbo:Work, X) is the movie/movies of (dbo:Person,Y?) ",SELECT ?X WHERE { Y dbo:Person ?X.},FALSE,FALSE,"List the (dbo:Work, X) movies of (dbo:Person,Y?) ",SELECT ?X WHERE { Y dbo:Person ?X.},"the movie of (dbo:Person,Y) ",,,
runtimeMinutes-of,noun,runtime in minutes,-,of,NounPPFrame,range,domain,1,dbo:Work/runtime,dbo:Work,http://dbpedia.org/datatype/minute,"What (http://dbpedia.org/datatype/minute, X) is the runtime in minutes/- of (dbo:Work,Y?) ",SELECT ?X WHERE { Y dbo:Work/runtime ?X.},FALSE,FALSE,"List the (http://dbpedia.org/datatype/minute, X) - of (dbo:Work,Y?) ",SELECT ?X WHERE { Y dbo:Work/runtime ?X.},"the runtime in minutes of (dbo:Work,Y) ",,,
awards-of,noun,award,-,of,NounPPFrame,range,domain,1,dbo:award,dbo:Work,dbo:award,"What (dbo:award, X) is the award/- of (dbo:Work,Y?) ",SELECT ?X WHERE { Y dbo:award ?X.},FALSE,FALSE,"List the (dbo:award, X) - of (dbo:Work,Y?) ",SELECT ?X WHERE { Y dbo:award ?X.},"the award of (dbo:Work,Y) ",,,
producer-of,noun,producer,-,of,NounPPFrame,range,domain,2,dbo:producer,dbo:Song,dbo:Person,"What (dbo:Person, X) is the producer/- of (dbo:Song,Y?) ",SELECT ?X WHERE { Y dbo:producer ?X.},"Which person,Who (dbo:Person, X) is,was the producer of (dbo:Song,Y?) (X dbo:producer Y)",SELECT ?X WHERE { Y dbo:producer ?X.},"List the (dbo:Person, X) - of (dbo:Song,Y?) ",SELECT ?X WHERE { Y dbo:producer ?X.},"the producer of (dbo:Song,Y) ",,,
bside-of,noun,B-side,-,of,NounPPFrame,range,domain,1,dbo:bsSde,dbo:Song,xsd:string,"What (xsd:string, X) is the B-side/- of (dbo:Song,Y?) ",SELECT ?X WHERE { Y dbo:bsSde ?X.},FALSE,FALSE,"List the (xsd:string, X) - of (dbo:Song,Y?) ",SELECT ?X WHERE { Y dbo:bsSde ?X.},"the B-side of (dbo:Song,Y) ",,,
releaseType-of,noun,realease type,-,of,NounPPFrame,range,domain,1,dbo:type,dbo:Song,xsd:string,"What (xsd:string, X) is the realease type/- of (dbo:Song,Y?) ",SELECT ?X WHERE { Y dbo:type ?X.},FALSE,FALSE,"List the (xsd:string, X) - of (dbo:Song,Y?) ",SELECT ?X WHERE { Y dbo:type ?X.},"the realease type of (dbo:Song,Y) ",,,
aside-of,noun,A-side,-,of,NounPPFrame,range,domain,1,dbo:aSide,dbo:Song,xsd:string,"What (xsd:string, X) is the A-side/- of (dbo:Song,Y?) ",SELECT ?X WHERE { Y dbo:aSide ?X.},FALSE,FALSE,"List the (xsd:string, X) - of (dbo:Song,Y?) ",SELECT ?X WHERE { Y dbo:aSide ?X.},"the A-side of (dbo:Song,Y) ",,,
literaryGenre-of,noun,literary genre,-,of,NounPPFrame,range,domain,2,dbo:literaryGenre,dbo:WrittenWork,dbo:literaryGenre,"What (dbo:literaryGenre, X) is the literary genre/- of (dbo:WrittenWork,Y?) ",SELECT ?X WHERE { Y dbo:literaryGenre ?X.},FALSE,FALSE,"List the (dbo:literaryGenre, X) - of (dbo:WrittenWork,Y?) ",SELECT ?X WHERE { Y dbo:literaryGenre ?X.},"the literary genre of (dbo:WrittenWork,Y) ",,,
language-of,noun,language,-,of,NounPPFrame,range,domain,1,dbo:language,dbo:WrittenWork,dbo:Language,"What (dbo:Language, X) is the language/- of (dbo:WrittenWork,Y?) ",SELECT ?X WHERE { Y dbo:language ?X.},FALSE,FALSE,"List the (dbo:Language, X) - of (dbo:WrittenWork,Y?) ",SELECT ?X WHERE { Y dbo:language ?X.},"the language of (dbo:WrittenWork,Y) ",,,
language-of,noun,language,-,of,NounPPFrame,range,domain,2,dbo:language,dbo:organisation,dbo:Language,"What (dbo:Language, X) is the language/- of (dbo:organisation,Y?) ",SELECT ?X WHERE { Y dbo:language ?X.},FALSE,FALSE,"List the (dbo:Language, X) - of (dbo:organisation,Y?) ",SELECT ?X WHERE { Y dbo:language ?X.},"the language of (dbo:organisation,Y) ",,,
publisher-of,noun,publisher,-,of,NounPPFrame,range,domain,2,dbo:publisher,dbo:WrittenWork,dbo:Agent,"What (dbo:Agent, X) is the publisher/- of (dbo:WrittenWork,Y?) ",SELECT ?X WHERE { Y dbo:publisher ?X.},FALSE,FALSE,"List the (dbo:Agent, X) - of (dbo:WrittenWork,Y?) ",SELECT ?X WHERE { Y dbo:publisher ?X.},"the publisher of (dbo:WrittenWork,Y) ",,,
mediaType-of,noun,media type,-,of,NounPPFrame,range,domain,1,dbo:mediaType,dbo:WrittenWork,dbo:mediaType,"What (dbo:mediaType, X) is the media type/- of (dbo:WrittenWork,Y?) ",SELECT ?X WHERE { Y dbo:mediaType ?X.},FALSE,FALSE,"List the (dbo:mediaType, X) - of (dbo:WrittenWork,Y?) ",SELECT ?X WHERE { Y dbo:mediaType ?X.},"the media type of (dbo:WrittenWork,Y) ",,,
series-of,noun,series,-,of,NounPPFrame,range,domain,1,dbo:series,dbo:WrittenWork,dbo:series,"What (dbo:series, X) is the series/- of (dbo:WrittenWork,Y?) ",SELECT ?X WHERE { Y dbo:series ?X.},FALSE,FALSE,"List the (dbo:series, X) - of (dbo:WrittenWork,Y?) ",SELECT ?X WHERE { Y dbo:series ?X.},"the series of (dbo:WrittenWork,Y) ",,,
colour-of,noun,colour,-,of,NounPPFrame,range,domain,1,dbo:colour,dbo:PoliticalParty,dbo:Colour,"What (dbo:Colour, X) is the colour/- of (dbo:PoliticalParty,Y?) ",SELECT ?X WHERE { Y dbo:colour ?X.},FALSE,FALSE,"List the (dbo:Colour, X) - of (dbo:PoliticalParty,Y?) ",SELECT ?X WHERE { Y dbo:colour ?X.},"the colour of (dbo:PoliticalParty,Y) ",,,
movie/show-of,noun,movie or show,movies or shows,of,NounPPFrame,range,domain,1,dbo:starring,dbo:Actor,dbo:Work,"What (dbo:Work, X) is the movie or show/movies or shows of (dbo:Actor,Y?) ",SELECT ?X WHERE { Y dbo:starring ?X.},FALSE,FALSE,"List the (dbo:Work, X) movies or shows of (dbo:Actor,Y?) ",SELECT ?X WHERE { Y dbo:starring ?X.},"the movie or show of (dbo:Actor,Y) ",,,
membership-of,noun,membership,-,of,NounPPFrame,range,domain,1,dbo:membership,dbo:Organisation,rdf:langString,"What (rdf:langString, X) is the membership/- of (dbo:Organisation,Y?) ",SELECT ?X WHERE { Y dbo:membership ?X.},FALSE,FALSE,"List the (rdf:langString, X) - of (dbo:Organisation,Y?) ",SELECT ?X WHERE { Y dbo:membership ?X.},"the membership of (dbo:Organisation,Y) ",,,
purpose-of,noun,purpose,-,of,NounPPFrame,range,domain,1,dbo:purpose,dbo:Organisation,xsd:string,"What (xsd:string, X) is the purpose/- of (dbo:Organisation,Y?) ",SELECT ?X WHERE { Y dbo:purpose ?X.},FALSE,FALSE,"List the (xsd:string, X) - of (dbo:Organisation,Y?) ",SELECT ?X WHERE { Y dbo:purpose ?X.},"the purpose of (dbo:Organisation,Y) ",,,
revenueYear-of,noun,year of reported revenue,-,of,NounPPFrame,range,domain,1,dbo:revenueYear,dbo:Organisation,xsd:gYear,"What (xsd:gYear, X) is the year of reported revenue/- of (dbo:Organisation,Y?) ",SELECT ?X WHERE { Y dbo:revenueYear ?X.},FALSE,FALSE,"List the (xsd:gYear, X) - of (dbo:Organisation,Y?) ",SELECT ?X WHERE { Y dbo:revenueYear ?X.},"the year of reported revenue of (dbo:Organisation,Y) ",,,
anthem-of,noun,anthem,anthems,of,NounPPFrame,range,domain,1,dbo:anthem,dbo:Country,xsd:string,"What (xsd:string, X) is the anthem/anthems of (dbo:Country,Y?) ",SELECT ?X WHERE { Y dbo:anthem ?X.},FALSE,FALSE,"List the (xsd:string, X) anthems of (dbo:Country,Y?) ",SELECT ?X WHERE { Y dbo:anthem ?X.},"the anthem of (dbo:Country,Y) ",,,
currencyCode-of,noun,currency code,-,of,NounPPFrame,range,domain,1,dbo:currencyCode,dbo:currency,xsd:string,"What (xsd:string, X) is the currency code/- of (dbo:currency,Y?) ",SELECT ?X WHERE { Y dbo:currencyCode ?X.},FALSE,FALSE,"List the (xsd:string, X) - of (dbo:currency,Y?) ",SELECT ?X WHERE { Y dbo:currencyCode ?X.},"the currency code of (dbo:currency,Y) ",,,
demonym-of,noun,demonym ,-,of,NounPPFrame,range,domain,1,dbo:demonym,dbo:Country,xsd:string,"What (xsd:string, X) is the demonym /- of (dbo:Country,Y?) ",SELECT ?X WHERE { Y dbo:demonym ?X.},FALSE,FALSE,"List the (xsd:string, X) - of (dbo:Country,Y?) ",SELECT ?X WHERE { Y dbo:demonym ?X.},"the demonym  of (dbo:Country,Y) ",,,
event-in,noun,event,events,in,NounPPFrame,range,domain,1,dbo:event,dbo:Country,xsd:string,"What (xsd:string, X) is the event/events in (dbo:Country,Y?) ",SELECT ?X WHERE { Y dbo:event ?X.},FALSE,FALSE,"List the (xsd:string, X) events in (dbo:Country,Y?) ",SELECT ?X WHERE { Y dbo:event ?X.},"the event in (dbo:Country,Y) ",,,
giniCoefficient-of,noun,gini coefficient,-,of,NounPPFrame,range,domain,1,dbo:giniCoefficient,dbo:Country,xsd:double,"What (xsd:double, X) is the gini coefficient/- of (dbo:Country,Y?) ",SELECT ?X WHERE { Y dbo:giniCoefficient ?X.},FALSE,FALSE,"List the (xsd:double, X) - of (dbo:Country,Y?) ",SELECT ?X WHERE { Y dbo:giniCoefficient ?X.},"the gini coefficient of (dbo:Country,Y) ",,,
house-of,noun,house,-,of,NounPPFrame,range,domain,1,dbo:house,dbo:Country,xsd:double,"What (xsd:double, X) is the house/- of (dbo:Country,Y?) ",SELECT ?X WHERE { Y dbo:house ?X.},FALSE,FALSE,"List the (xsd:double, X) - of (dbo:Country,Y?) ",SELECT ?X WHERE { Y dbo:house ?X.},"the house of (dbo:Country,Y) ",,,
country-of,noun,country,-,of,NounPPFrame,range,domain,1,dbo:Country,dbo:City,xsd:string,"What (xsd:string, X) is the country/- of (dbo:City,Y?) ",SELECT ?X WHERE { Y dbo:Country ?X.},FALSE,FALSE,"List the (xsd:string, X) - of (dbo:City,Y?) ",SELECT ?X WHERE { Y dbo:Country ?X.},"the country of (dbo:City,Y) ",,,
leaderName-of,noun,leader name,-,of,NounPPFrame,range,domain,1,dbo:leaderName,dbo:City,xsd:string,"What (xsd:string, X) is the leader name/- of (dbo:City,Y?) ",SELECT ?X WHERE { Y dbo:leaderName ?X.},FALSE,FALSE,"List the (xsd:string, X) - of (dbo:City,Y?) ",SELECT ?X WHERE { Y dbo:leaderName ?X.},"the leader name of (dbo:City,Y) ",,,
leaderTitle-of,noun,leader title ,-,of,NounPPFrame,range,domain,1,dbo:leaderTitle,dbo:leader,xsd:string,"What (xsd:string, X) is the leader title /- of (dbo:leader,Y?) ",SELECT ?X WHERE { Y dbo:leaderTitle ?X.},FALSE,FALSE,"List the (xsd:string, X) - of (dbo:leader,Y?) ",SELECT ?X WHERE { Y dbo:leaderTitle ?X.},"the leader title  of (dbo:leader,Y) ",,,
licenseNumber-of,noun,license number,-,of,NounPPFrame,range,domain,1,dbo:licenseNumber,dbo:City,xsd:string,"What (xsd:string, X) is the license number/- of (dbo:City,Y?) ",SELECT ?X WHERE { Y dbo:licenseNumber ?X.},FALSE,FALSE,"List the (xsd:string, X) - of (dbo:City,Y?) ",SELECT ?X WHERE { Y dbo:licenseNumber ?X.},"the license number of (dbo:City,Y) ",,,
motto-of,noun,motto,-,of,NounPPFrame,range,domain,1,dbo:motto,dbo:City,xsd:string,"What (xsd:string, X) is the motto/- of (dbo:City,Y?) ",SELECT ?X WHERE { Y dbo:motto ?X.},FALSE,FALSE,"List the (xsd:string, X) - of (dbo:City,Y?) ",SELECT ?X WHERE { Y dbo:motto ?X.},"the motto of (dbo:City,Y) ",,,
-,noun,motto,-,of,NounPPFrame,range,domain,2,dbo:motto,dbo:Public_univerity,xsd:string,"What (xsd:string, X) is the motto/- of (dbo:Public_univerity,Y?) ",SELECT ?X WHERE { Y dbo:motto ?X.},FALSE,FALSE,"List the (xsd:string, X) - of (dbo:Public_univerity,Y?) ",SELECT ?X WHERE { Y dbo:motto ?X.},"the motto of (dbo:Public_univerity,Y) ",,,
percentageOfAreaWater-of,noun,percentage of area water,-,of,NounPPFrame,range,domain,1,dbo:percentageOfAreaWater,dbo:City,xsd:double,"What (xsd:double, X) is the percentage of area water/- of (dbo:City,Y?) ",SELECT ?X WHERE { Y dbo:percentageOfAreaWater ?X.},FALSE,FALSE,"List the (xsd:double, X) - of (dbo:City,Y?) ",SELECT ?X WHERE { Y dbo:percentageOfAreaWater ?X.},"the percentage of area water of (dbo:City,Y) ",,,
subdivision-of,noun,subdivision,subdivisions,of,NounPPFrame,range,domain,1,dbo:subdivision,dbo:City,xsd:string,"What (xsd:string, X) is the subdivision/subdivisions of (dbo:City,Y?) ",SELECT ?X WHERE { Y dbo:subdivision ?X.},FALSE,FALSE,"List the (xsd:string, X) subdivisions of (dbo:City,Y?) ",SELECT ?X WHERE { Y dbo:subdivision ?X.},"the subdivision of (dbo:City,Y) ",,,
timeZone-of,noun,time zone,time zones,of,NounPPFrame,range,domain,1,dbo:timezone,dbo:City,xsd:string,"What (xsd:string, X) is the time zone/time zones of (dbo:City,Y?) ",SELECT ?X WHERE { Y dbo:timezone ?X.},FALSE,FALSE,"List the (xsd:string, X) time zones of (dbo:City,Y?) ",SELECT ?X WHERE { Y dbo:timezone ?X.},"the time zone of (dbo:City,Y) ",,,
-,noun,time zone,time zones,of,NounPPFrame,range,domain,2,dbo:timezone,dbo:Country,xsd:string,"What (xsd:string, X) is the time zone/time zones of (dbo:Country,Y?) ",SELECT ?X WHERE { Y dbo:timezone ?X.},FALSE,FALSE,"List the (xsd:string, X) time zones of (dbo:Country,Y?) ",SELECT ?X WHERE { Y dbo:timezone ?X.},"the time zone of (dbo:Country,Y) ",,,
child-of,noun,child,children,of,NounPPFrame,range,domain,1,dbo:child,dbo:Person,dbo:Person,"What (dbo:Person, X) is the child/children of (dbo:Person,Y?) ",SELECT ?X WHERE { Y dbo:child ?X.},"Which person,Who (dbo:Person, X) is,was the child of (dbo:Person,Y?) (X dbo:child Y)",SELECT ?X WHERE { Y dbo:child ?X.},"List the (dbo:Person, X) children of (dbo:Person,Y?) ",SELECT ?X WHERE { Y dbo:child ?X.},"the child of (dbo:Person,Y) ",,,
deathPlace-of,noun,death place,-,of,NounPPFrame,range,domain,1,dbo:deathPlace,dbo:Person,xsd:string,"What (xsd:string, X) is the death place/- of (dbo:Person,Y?) ",SELECT ?X WHERE { Y dbo:deathPlace ?X.},FALSE,FALSE,"List the (xsd:string, X) - of (dbo:Person,Y?) ",SELECT ?X WHERE { Y dbo:deathPlace ?X.},"the death place of (dbo:Person,Y) ",,,
relative-of,noun,relative,relatives,of,NounPPFrame,range,domain,1,dbo:relative,dbo:Person,xsd:string,"What (xsd:string, X) is the relative/relatives of (dbo:Person,Y?) ",SELECT ?X WHERE { Y dbo:relative ?X.},FALSE,FALSE,"List the (xsd:string, X) relatives of (dbo:Person,Y?) ",SELECT ?X WHERE { Y dbo:relative ?X.},"the relative of (dbo:Person,Y) ",,,
numberOfStudents-of,noun,number of students,-,of,NounPPFrame,range,domain,1,dbo:numberOfStudents,dbo:EducationalInstitution,xsd:nonNegativeInteger,"What (xsd:nonNegativeInteger, X) is the number of students/- of (dbo:EducationalInstitution,Y?) ",SELECT ?X WHERE { Y dbo:numberOfStudents ?X.},FALSE,FALSE,"List the (xsd:nonNegativeInteger, X) - of (dbo:EducationalInstitution,Y?) ",SELECT ?X WHERE { Y dbo:numberOfStudents ?X.},"the number of students of (dbo:EducationalInstitution,Y) ",,,
numberOfPostgraduateStudents,noun,number of postgraduate students,-,of,NounPPFrame,range,domain,1,dbo:numberOfPostgraduateStudents,dbo:University,xsd:nonNegativeInteger,"What (xsd:nonNegativeInteger, X) is the number of postgraduate students/- of (dbo:University,Y?) ",SELECT ?X WHERE { Y dbo:numberOfPostgraduateStudents ?X.},FALSE,FALSE,"List the (xsd:nonNegativeInteger, X) - of (dbo:University,Y?) ",SELECT ?X WHERE { Y dbo:numberOfPostgraduateStudents ?X.},"the number of postgraduate students of (dbo:University,Y) ",,,
