LemonEntry,partOfSpeech,writtenForm (singular),writtenForm (plural),preposition,SyntacticFrame,copulativeArg,prepositionalAdjunct,sense,reference,domain,range,GrammarRule1:question1,SPARQL,GrammarRule1: question2,SPARQL Question 2,GrammarRule 1: questions,SPARQL ,NP (Grammar Rule 2),,grammar rules,numberOfQuestions
birthPlace_of,noun,birth place,-,of,NounPPFrame,range,domain,1,dbo:birthPlace,dbo:Person,dbo:Place,"What (dbo:Place, X) is the birth place/- of (dbo:Person,Y?) ",SELECT ?X WHERE { Y dbo:birthPlace ?X.},FALSE,FALSE,"List the (dbo:Place, X) - of (dbo:Person,Y?) ",SELECT ?X WHERE { Y dbo:birthPlace ?X.},"the birth place of (dbo:Person,Y) ",,2,
height_of,noun,height,-,of,NounPPFrame,range,domain,1,dbo:height,dbo:Person,xsd:double,"What (xsd:double, X) is the height/- of (dbo:Person,Y?) ",SELECT ?X WHERE { Y dbo:height ?X.},FALSE,FALSE,"List the (xsd:double, X) - of (dbo:Person,Y?) ",SELECT ?X WHERE { Y dbo:height ?X.},"the height of (dbo:Person,Y) ",,2,
deathPlace_of,noun,death place,-,of,NounPPFrame,range,domain,1,dbo:deathPlace,dbo:Person,dbo:Place,"What (dbo:Place, X) is the death place/- of (dbo:Person,Y?) ",SELECT ?X WHERE { Y dbo:deathPlace ?X.},FALSE,FALSE,"List the (dbo:Place, X) - of (dbo:Person,Y?) ",SELECT ?X WHERE { Y dbo:deathPlace ?X.},"the death place of (dbo:Person,Y) ",,2,
father_of,noun,father,-,of,NounPPFrame,range,domain,1,dbo:father,dbo:Person,dbo:Person,"What (dbo:Person, X) is the father/- of (dbo:Person,Y?) ",SELECT ?X WHERE { Y dbo:father ?X.},"Who (dbo:Person, X) is the father of (dbo:Person,Y?) (X dbo:father Y)",SELECT ?X WHERE { Y dbo:father ?X.},"List the (dbo:Person, X) - of (dbo:Person,Y?) ",SELECT ?X WHERE { Y dbo:father ?X.},"the father of (dbo:Person,Y) ",,2,
successor-of,noun,successor,-,of,NounPPFrame,range,domain,1,dbo:successor,dbo:Person,dbo:Person,"What (dbo:Person, X) is the successor/- of (dbo:Person,Y?) ",SELECT ?X WHERE { Y dbo:successor ?X.},"Which person,Who (dbo:Person, X) is,was the successor of (dbo:Person,Y?) (X dbo:successor Y)",SELECT ?X WHERE { Y dbo:successor ?X.},"List the (dbo:Person, X) - of (dbo:Person,Y?) ",SELECT ?X WHERE { Y dbo:successor ?X.},"the successor of (dbo:Person,Y) ",,2,
residence-of,noun,residence,residences,of,NounPPFrame,range,domain,1,dbo:residence,dbo:Place,dbo:Person,-,SELECT ?X WHERE { Y dbo:residence ?X.},"Which person,Who (dbo:Person, X) is,was the residence of (dbo:Place,Y?) (X dbo:residence Y)",SELECT ?X WHERE { Y dbo:residence ?X.},"List the (dbo:Person, X) residences of (dbo:Place,Y?) ",SELECT ?X WHERE { Y dbo:residence ?X.},"the residence of (dbo:Place,Y) ",,2,
partner-of,noun,partner,partners,of,NounPPFrame,range,domain,1,dbo:partner,dbo:Person,dbo:Person,-,SELECT ?X WHERE { Y dbo:partner ?X.},"Which person,Who (dbo:Person, X) is,was the partner of (dbo:Person,Y?) (X dbo:partner Y)",SELECT ?X WHERE { Y dbo:partner ?X.},"List the (dbo:Person, X) partners of (dbo:Person,Y?) ",SELECT ?X WHERE { Y dbo:partner ?X.},"the partner of (dbo:Person,Y) ",,2,
spouse-of,noun,spouse,spouses,of,NounPPFrame,range,domain,1,dbo:spouse,dbo:Person,dbo:Person,-,SELECT ?X WHERE { Y dbo:spouse ?X.},"Which person,Who (dbo:Person, X) is,was the spouse of (dbo:Person,Y?) (X dbo:spouse Y)",SELECT ?X WHERE { Y dbo:spouse ?X.},"List the (dbo:Person, X) spouses of (dbo:Person,Y?) ",SELECT ?X WHERE { Y dbo:spouse ?X.},"the spouse of (dbo:Person,Y) ",,2,
birthDate-of,noun,birth date,-,of,NounPPFrame,range,domain,1,dbo:birthDate,dbo:Person,https://www.w3.org/2001/XMLSchema#date,"What (https://www.w3.org/2001/XMLSchema#date, X) is the birth date/- of (dbo:Person,Y?) ",SELECT ?X WHERE { Y dbo:birthDate ?X.},FALSE,FALSE,"List the (https://www.w3.org/2001/XMLSchema#date, X) - of (dbo:Person,Y?) ",SELECT ?X WHERE { Y dbo:birthDate ?X.},"the birth date of (dbo:Person,Y) ",,2,
education-of,noun,education,-,of,NounPPFrame,range,domain,1,dbo:education,dbo:Person,xsd:string,"What (xsd:string, X) is the education/- of (dbo:Person,Y?) ",SELECT ?X WHERE { Y dbo:education ?X.},FALSE,FALSE,"List the (xsd:string, X) - of (dbo:Person,Y?) ",SELECT ?X WHERE { Y dbo:education ?X.},"the education of (dbo:Person,Y) ",,2,
nationality_of,noun,nationality,-,of,NounPPFrame,range,domain,1,dbo:nationality,dbo:Person,dbo:Country,"What (dbo:Country, X) is the nationality/- of (dbo:Person,Y?) ",SELECT ?X WHERE { Y dbo:nationality ?X.},FALSE,FALSE,"List the (dbo:Country, X) - of (dbo:Person,Y?) ",SELECT ?X WHERE { Y dbo:nationality ?X.},"the nationality of (dbo:Person,Y) ",,2,
editor_of,noun,editor,editors,of,NounPPFrame,range,domain,1,dbo:editor,dbo:Work,dbo:Person,"What (dbo:Person, X) is the editor/editors of (dbo:Work,Y?) ",SELECT ?X WHERE { Y dbo:editor ?X.},"Who (dbo:Person, X) is the editor of (dbo:Work,Y?) (X dbo:editor Y)",SELECT ?X WHERE { Y dbo:editor ?X.},"List the (dbo:Person, X) editors of (dbo:Work,Y?) ",SELECT ?X WHERE { Y dbo:editor ?X.},"the editor of (dbo:Work,Y) ",,2,
creator_of,noun,creator,creators,of,NounPPFrame,range,domain,1,dbo:creator,dbo:Person,dbo:Agent,"What (dbo:Agent, X) is the creator/creators of (dbo:Person,Y?) ",SELECT ?X WHERE { Y dbo:creator ?X.},FALSE,FALSE,"List the (dbo:Agent, X) creators of (dbo:Person,Y?) ",SELECT ?X WHERE { Y dbo:creator ?X.},"the creator of (dbo:Person,Y) ",,2,
capital-of,noun,capital,-,of,NounPPFrame,range,domain,1,dbo:capital,dbo:Country,dbo:City,"What (dbo:City, X) is the capital/- of (dbo:Country,Y?) ",SELECT ?X WHERE { Y dbo:capital ?X.},FALSE,FALSE,"List the (dbo:City, X) - of (dbo:Country,Y?) ",SELECT ?X WHERE { Y dbo:capital ?X.},"the capital of (dbo:Country,Y) ",,2,
city-of,noun,city,cities,of,NounPPFrame,range,domain,1,dbo:city,dbo:Country,dbo:City,"What (dbo:City, X) is the city/cities of (dbo:Country,Y?) ",SELECT ?X WHERE { Y dbo:city ?X.},FALSE,FALSE,"List the (dbo:City, X) cities of (dbo:Country,Y?) ",SELECT ?X WHERE { Y dbo:city ?X.},"the city of (dbo:Country,Y) ",,2,
formOfGovernment-of,noun,form of government,-,of,NounPPFrame,range,domain,1,dbo:governmentType,dbo:Country,dbo:GovernmentType,"What (dbo:GovernmentType, X) is the form of government/- of (dbo:Country,Y?) ",SELECT ?X WHERE { Y dbo:governmentType ?X.},FALSE,FALSE,"List the (dbo:GovernmentType, X) - of (dbo:Country,Y?) ",SELECT ?X WHERE { Y dbo:governmentType ?X.},"the form of government of (dbo:Country,Y) ",,2,
countryCode-of,noun,country code,-,of,NounPPFrame,range,domain,1,dbo:countryCode,dbo:Country,xsd:integer,"What (xsd:integer, X) is the country code/- of (dbo:Country,Y?) ",SELECT ?X WHERE { Y dbo:countryCode ?X.},FALSE,FALSE,"List the (xsd:integer, X) - of (dbo:Country,Y?) ",SELECT ?X WHERE { Y dbo:countryCode ?X.},"the country code of (dbo:Country,Y) ",,2,
assets-of,noun,assets,-,of,NounPPFrame,range,domain,1,dbo:assets,dbo:Company,xsd:double,"What (xsd:double, X) is the assets/- of (dbo:Company,Y?) ",SELECT ?X WHERE { Y dbo:assets ?X.},FALSE,FALSE,"List the (xsd:double, X) - of (dbo:Company,Y?) ",SELECT ?X WHERE { Y dbo:assets ?X.},"the assets of (dbo:Company,Y) ",,2,
subsidiary-of,noun,subsidiary,subsidiaries,of,NounPPFrame,range,domain,1,dbo:subsidiary,dbo:Company,dbo:Company,"What (dbo:Company, X) is the subsidiary/subsidiaries of (dbo:Company,Y?) ",SELECT ?X WHERE { Y dbo:subsidiary ?X.},FALSE,FALSE,"List the (dbo:Company, X) subsidiaries of (dbo:Company,Y?) ",SELECT ?X WHERE { Y dbo:subsidiary ?X.},"the subsidiary of (dbo:Company,Y) ",,2,
predecessor-of,noun,predecessor,-,of,NounPPFrame,range,domain,1,dbo:predecessor,dbo:Person,dbo:Politician,"What (dbo:Politician, X) is the predecessor/- of (dbo:Person,Y?) ",SELECT ?X WHERE { Y dbo:predecessor ?X.},FALSE,FALSE,"List the (dbo:Politician, X) - of (dbo:Person,Y?) ",SELECT ?X WHERE { Y dbo:predecessor ?X.},"the predecessor of (dbo:Person,Y) ",,2,
equity-of,noun,equity,-,of,NounPPFrame,range,domain,1,dbo:equity,dbo:Company,xsd:double,"What (xsd:double, X) is the equity/- of (dbo:Company,Y?) ",SELECT ?X WHERE { Y dbo:equity ?X.},FALSE,FALSE,"List the (xsd:double, X) - of (dbo:Company,Y?) ",SELECT ?X WHERE { Y dbo:equity ?X.},"the equity of (dbo:Company,Y) ",,2,
postalCode-of,noun,postal code,-,of,NounPPFrame,range,domain,1,dbo:postalCode,dbo:City,xsd:string,"What (xsd:string, X) is the postal code/- of (dbo:City,Y?) ",SELECT ?X WHERE { Y dbo:postalCode ?X.},FALSE,FALSE,"List the (xsd:string, X) - of (dbo:City,Y?) ",SELECT ?X WHERE { Y dbo:postalCode ?X.},"the postal code of (dbo:City,Y) ",,2,
populationTotal-of,noun,total population,-,of,NounPPFrame,range,domain,1,dbo:populationTotal,dbo:Place,xsd:nonNegativeInteger,"What (xsd:nonNegativeInteger, X) is the total population/- of (dbo:Place,Y?) ",SELECT ?X WHERE { Y dbo:populationTotal ?X.},FALSE,FALSE,"List the (xsd:nonNegativeInteger, X) - of (dbo:Place,Y?) ",SELECT ?X WHERE { Y dbo:populationTotal ?X.},"the total population of (dbo:Place,Y) ",,2,
completionDate-of,noun,completion date,-,of,NounPPFrame,range,domain,1,dbo:completionDate,dbo:TelevisionShow,xsd:date,"What (xsd:date, X) is the completion date/- of (dbo:TelevisionShow,Y?) ",SELECT ?X WHERE { Y dbo:completionDate ?X.},FALSE,FALSE,"List the (xsd:date, X) - of (dbo:TelevisionShow,Y?) ",SELECT ?X WHERE { Y dbo:completionDate ?X.},"the completion date of (dbo:TelevisionShow,Y) ",,2,
nearestCity-to,noun,nearest city,nearest cities,to,NounPPFrame,range,domain,1,dbo:nearestCity,dbo:Place,dbo:PopulatedPlace,"What (dbo:PopulatedPlace, X) is the nearest city/nearest cities to (dbo:Place,Y?) ",SELECT ?X WHERE { Y dbo:nearestCity ?X.},FALSE,FALSE,"List the (dbo:PopulatedPlace, X) nearest cities to (dbo:Place,Y?) ",SELECT ?X WHERE { Y dbo:nearestCity ?X.},"the nearest city to (dbo:Place,Y) ",,2,
revenue-of,noun,revenue,-,of,NounPPFrame,range,domain,1,dbo:revenue,dbo:Organisation,xsd:double,"What (xsd:double, X) is the revenue/- of (dbo:Organisation,Y?) ",SELECT ?X WHERE { Y dbo:revenue ?X.},FALSE,FALSE,"List the (xsd:double, X) - of (dbo:Organisation,Y?) ",SELECT ?X WHERE { Y dbo:revenue ?X.},"the revenue of (dbo:Organisation,Y) ",,2,
keyPerson-of,noun,key person,key persons,of,NounPPFrame,range,domain,1,dbo:keyPerson,dbo:Organisation,dbo:Person,"What (dbo:Person, X) is the key person/key persons of (dbo:Organisation,Y?) ",SELECT ?X WHERE { Y dbo:keyPerson ?X.},"Which person,Who (dbo:Person, X) is,was the key person of (dbo:Organisation,Y?) (X dbo:keyPerson Y)",SELECT ?X WHERE { Y dbo:keyPerson ?X.},"List the (dbo:Person, X) key persons of (dbo:Organisation,Y?) ",SELECT ?X WHERE { Y dbo:keyPerson ?X.},"the key person of (dbo:Organisation,Y) ",,2,
formerName-of,noun,former name,-,of,NounPPFrame,range,domain,1,dbo:formerName,dbo:Organisation,rdf:langString,"What (rdf:langString, X) is the former name/- of (dbo:Organisation,Y?) ",SELECT ?X WHERE { Y dbo:formerName ?X.},FALSE,FALSE,"List the (rdf:langString, X) - of (dbo:Organisation,Y?) ",SELECT ?X WHERE { Y dbo:formerName ?X.},"the former name of (dbo:Organisation,Y) ",,2,
abbreviation-of,noun,abbrevation,-,of,NounPPFrame,range,domain,1,dbo:abbreviation,dbo:Organisation,xsd:string,"What (xsd:string, X) is the abbrevation/- of (dbo:Organisation,Y?) ",SELECT ?X WHERE { Y dbo:abbreviation ?X.},FALSE,FALSE,"List the (xsd:string, X) - of (dbo:Organisation,Y?) ",SELECT ?X WHERE { Y dbo:abbreviation ?X.},"the abbrevation of (dbo:Organisation,Y) ",,2,
formationDate-of,noun,formation date,-,of,NounPPFrame,range,domain,1,dbo:formationDate,dbo:Organisation,xsd:date,"What (xsd:date, X) is the formation date/- of (dbo:Organisation,Y?) ",SELECT ?X WHERE { Y dbo:formationDate ?X.},FALSE,FALSE,"List the (xsd:date, X) - of (dbo:Organisation,Y?) ",SELECT ?X WHERE { Y dbo:formationDate ?X.},"the formation date of (dbo:Organisation,Y) ",,2,
runtime-of,noun,runtime,-,of,NounPPFrame,range,domain,2,dbo:runtime,dbo:TelevisionShow,xsd:double,"What (xsd:double, X) is the runtime/- of (dbo:TelevisionShow,Y?) ",SELECT ?X WHERE { Y dbo:runtime ?X.},FALSE,FALSE,"List the (xsd:double, X) - of (dbo:TelevisionShow,Y?) ",SELECT ?X WHERE { Y dbo:runtime ?X.},"the runtime of (dbo:TelevisionShow,Y) ",,2,
associatedMusicalArtist-of,noun,associated musical artist ,associated musical artists,of,NounPPFrame,range,domain,1,dbo:associatedMusicalArtist,dbo:MusicalArtist,dbo:Person,-,SELECT ?X WHERE { Y dbo:associatedMusicalArtist ?X.},"Which person,Who (dbo:Person, X) is,was the associated musical artist  of (dbo:MusicalArtist,Y?) (X dbo:associatedMusicalArtist Y)",SELECT ?X WHERE { Y dbo:associatedMusicalArtist ?X.},"List the (dbo:Person, X) associated musical artists of (dbo:MusicalArtist,Y?) ",SELECT ?X WHERE { Y dbo:associatedMusicalArtist ?X.},"the associated musical artist  of (dbo:MusicalArtist,Y) ",,2,
artist-of,noun,artist,artists,of,NounPPFrame,range,domain,1,dbo:artist,dbo:MusicalWork,dbo:Agent,-,SELECT ?X WHERE { Y dbo:artist ?X.},FALSE,FALSE,"List the (dbo:Agent, X) artists of (dbo:MusicalWork,Y?) ",SELECT ?X WHERE { Y dbo:artist ?X.},"the artist of (dbo:MusicalWork,Y) ",,2,
buidlingEndDate-of,noun,building end date,building end dates,of,NounPPFrame,range,domain,1,dbo:buildingEndDate,dbo:Location,xsd:date,"What (xsd:date, X) is the building end date/building end dates of (dbo:Location,Y?) ",SELECT ?X WHERE { Y dbo:buildingEndDate ?X.},FALSE,FALSE,"List the (xsd:date, X) building end dates of (dbo:Location,Y?) ",SELECT ?X WHERE { Y dbo:buildingEndDate ?X.},"the building end date of (dbo:Location,Y) ",,2,
occupation-of,noun,occupation,occupations,of,NounPPFrame,range,domain,1,dbo:occupation,dbo:Person,dbo:PersonFunction,"What (dbo:PersonFunction, X) is the occupation/occupations of (dbo:Person,Y?) ",SELECT ?X WHERE { Y dbo:occupation ?X.},FALSE,FALSE,"List the (dbo:PersonFunction, X) occupations of (dbo:Person,Y?) ",SELECT ?X WHERE { Y dbo:occupation ?X.},"the occupation of (dbo:Person,Y) ",,2,
length_of,noun,length,-,of,NounPPFrame,range,domain,1,dbp:length,dbo:River,xsd:nonNegativeInteger,"What (xsd:nonNegativeInteger, X) is the length/- of (dbo:River,Y?) ",SELECT ?X WHERE { Y dbp:length ?X.},FALSE,FALSE,"List the (xsd:nonNegativeInteger, X) - of (dbo:River,Y?) ",SELECT ?X WHERE { Y dbp:length ?X.},"the length of (dbo:River,Y) ",,2,
opponent-of,noun,opponent,opponents,of,NounPPFrame,range,domain,1,dbo:opponent,dbo:Person,dbo:Person,-,SELECT ?X WHERE { Y dbo:opponent ?X.},"Which person,Who (dbo:Person, X) is,was the opponent of (dbo:Person,Y?) (X dbo:opponent Y)",SELECT ?X WHERE { Y dbo:opponent ?X.},"List the (dbo:Person, X) opponents of (dbo:Person,Y?) ",SELECT ?X WHERE { Y dbo:opponent ?X.},"the opponent of (dbo:Person,Y) ",,2,
showJudge-of,noun,show judge,show judges,of,NounPPFrame,range,domain,1,dbo:showJudge ,dbo:TelevisionShow,dbo:Person,-,SELECT ?X WHERE { Y dbo:showJudge  ?X.},"Which person,Who (dbo:Person, X) is,was the show judge of (dbo:TelevisionShow,Y?) (X dbo:showJudge  Y)",SELECT ?X WHERE { Y dbo:showJudge  ?X.},"List the (dbo:Person, X) show judges of (dbo:TelevisionShow,Y?) ",SELECT ?X WHERE { Y dbo:showJudge  ?X.},"the show judge of (dbo:TelevisionShow,Y) ",,2,
electoralDistrict-of,noun,electoral District,-,of,NounPPFrame,range,domain,1,dbo:region,dbo:Politician,dbo:Place,"What (dbo:Place, X) is the electoral District/- of (dbo:Politician,Y?) ",SELECT ?X WHERE { Y dbo:region ?X.},FALSE,FALSE,"List the (dbo:Place, X) - of (dbo:Politician,Y?) ",SELECT ?X WHERE { Y dbo:region ?X.},"the electoral District of (dbo:Politician,Y) ",,2,
releaseDate-of,noun,realease date,-,of,NounPPFrame,range,domain,2,dbo:releaseDate,dbo:Song,xsd:date,"What (xsd:date, X) is the realease date/- of (dbo:Song,Y?) ",SELECT ?X WHERE { Y dbo:releaseDate ?X.},FALSE,FALSE,"List the (xsd:date, X) - of (dbo:Song,Y?) ",SELECT ?X WHERE { Y dbo:releaseDate ?X.},"the realease date of (dbo:Song,Y) ",,2,
-,noun,release date,-,of,NounPPFrame,range,domain,1,dbo:releaseDate,dbo:Work,xsd:date,"What (xsd:date, X) is the release date/- of (dbo:Work,Y?) ",SELECT ?X WHERE { Y dbo:releaseDate ?X.},FALSE,FALSE,"List the (xsd:date, X) - of (dbo:Work,Y?) ",SELECT ?X WHERE { Y dbo:releaseDate ?X.},"the release date of (dbo:Work,Y) ",,2,
publicationDate-of,noun,publication date,-,of,NounPPFrame,range,domain,1,dbo:publicationDate,dbo:WrittenWork,xsd:date,"What (xsd:date, X) is the publication date/- of (dbo:WrittenWork,Y?) ",SELECT ?X WHERE { Y dbo:publicationDate ?X.},FALSE,FALSE,"List the (xsd:date, X) - of (dbo:WrittenWork,Y?) ",SELECT ?X WHERE { Y dbo:publicationDate ?X.},"the publication date of (dbo:WrittenWork,Y) ",,2,
numberOfPages-of,noun,number of pages,-,of,NounPPFrame,range,domain,1,dbo:numberOfPages,dbo:WrittenWork,xsd:positiveInteger,"What (xsd:positiveInteger, X) is the number of pages/- of (dbo:WrittenWork,Y?) ",SELECT ?X WHERE { Y dbo:numberOfPages ?X.},FALSE,FALSE,"List the (xsd:positiveInteger, X) - of (dbo:WrittenWork,Y?) ",SELECT ?X WHERE { Y dbo:numberOfPages ?X.},"the number of pages of (dbo:WrittenWork,Y) ",,2,
genre-of,noun,genre,genres,of,NounPPFrame,range,domain,1,dbo:genre,dbo:Work,dbo:Genre,"What (dbo:Genre, X) is the genre/genres of (dbo:Work,Y?) ",SELECT ?X WHERE { Y dbo:genre ?X.},FALSE,FALSE,"List the (dbo:Genre, X) genres of (dbo:Work,Y?) ",SELECT ?X WHERE { Y dbo:genre ?X.},"the genre of (dbo:Work,Y) ",,2,
composer-of,noun,composer,composers,of,NounPPFrame,range,domain,1,dbo:composer,dbo:Work,dbo:Person,-,SELECT ?X WHERE { Y dbo:composer ?X.},"Which person,Who (dbo:Person, X) is,was the composer of (dbo:Work,Y?) (X dbo:composer Y)",SELECT ?X WHERE { Y dbo:composer ?X.},"List the (dbo:Person, X) composers of (dbo:Work,Y?) ",SELECT ?X WHERE { Y dbo:composer ?X.},"the composer of (dbo:Work,Y) ",,2,
-,noun,composer,composers,of,NounPPFrame,range,domain,2,dbo:composer,dbo:TelevisionShow,xsd:string,-,SELECT ?X WHERE { Y dbo:composer ?X.},FALSE,FALSE,"List the (xsd:string, X) composers of (dbo:TelevisionShow,Y?) ",SELECT ?X WHERE { Y dbo:composer ?X.},"the composer of (dbo:TelevisionShow,Y) ",,2,
director-of,noun,director,directors,of,NounPPFrame,range,domain,1,dbo:director,dbo:Film,dbo:Person,-,SELECT ?X WHERE { Y dbo:director ?X.},"Which person,Who (dbo:Person, X) is,was the director of (dbo:Film,Y?) (X dbo:director Y)",SELECT ?X WHERE { Y dbo:director ?X.},"List the (dbo:Person, X) directors of (dbo:Film,Y?) ",SELECT ?X WHERE { Y dbo:director ?X.},"the director of (dbo:Film,Y) ",,2,
budget-of,noun,budget,budgets,of,NounPPFrame,range,domain,1,dbo:budget,dbo:Film,xsd:double,"What (xsd:double, X) is the budget/budgets of (dbo:Film,Y?) ",SELECT ?X WHERE { Y dbo:budget ?X.},FALSE,FALSE,"List the (xsd:double, X) budgets of (dbo:Film,Y?) ",SELECT ?X WHERE { Y dbo:budget ?X.},"the budget of (dbo:Film,Y) ",,2,
musicComposer-of,noun,music composer,music composers,of,NounPPFrame,range,domain,1,dbo:musicComposer,dbo:Film,dbo:Person,-,SELECT ?X WHERE { Y dbo:musicComposer ?X.},"Which person,Who (dbo:Person, X) is,was the music composer of (dbo:Film,Y?) (X dbo:musicComposer Y)",SELECT ?X WHERE { Y dbo:musicComposer ?X.},"List the (dbo:Person, X) music composers of (dbo:Film,Y?) ",SELECT ?X WHERE { Y dbo:musicComposer ?X.},"the music composer of (dbo:Film,Y) ",,2,
alterEgo-of,noun,elevation,-,of,NounPPFrame,range,domain,1,dbo:areaUrban,dbo: PopulatedPlace,xsd:double,"What (xsd:double, X) is the elevation/- of (dbo: PopulatedPlace,Y?) ",SELECT ?X WHERE { Y dbo:areaUrban ?X.},FALSE,FALSE,"List the (xsd:double, X) - of (dbo: PopulatedPlace,Y?) ",SELECT ?X WHERE { Y dbo:areaUrban ?X.},"the elevation of (dbo: PopulatedPlace,Y) ",,2,
areaCode_of,noun,area code,-,of,NounPPFrame,range,domain,1,dbo:areaCode,dbo:Place,xsd:string,"What (xsd:string, X) is the area code/- of (dbo:Place,Y?) ",SELECT ?X WHERE { Y dbo:areaCode ?X.},FALSE,FALSE,"List the (xsd:string, X) - of (dbo:Place,Y?) ",SELECT ?X WHERE { Y dbo:areaCode ?X.},"the area code of (dbo:Place,Y) ",,2,
artisticMovement_of,noun,artistic movement,artistic movements,of,NounPPFrame,range,domain,1,dbo:movement,dbo:Artist,owl:Thing,"What (owl:Thing, X) is the artistic movement/artistic movements of (dbo:Artist,Y?) ",SELECT ?X WHERE { Y dbo:movement ?X.},FALSE,FALSE,"List the (owl:Thing, X) artistic movements of (dbo:Artist,Y?) ",SELECT ?X WHERE { Y dbo:movement ?X.},"the artistic movement of (dbo:Artist,Y) ",,2,
author_of,noun,author,authors,of,NounPPFrame,range,domain,1,dbo:author,dbo:Work,dbo:Person,"What (dbo:Person, X) is the author/authors of (dbo:Work,Y?) ",SELECT ?X WHERE { Y dbo:author ?X.},"Which person,Who (dbo:Person, X) is,was the author of (dbo:Work,Y?) (X dbo:author Y)",SELECT ?X WHERE { Y dbo:author ?X.},"List the (dbo:Person, X) authors of (dbo:Work,Y?) ",SELECT ?X WHERE { Y dbo:author ?X.},"the author of (dbo:Work,Y) ",,2,
birthYear_of,noun,birth year,-,of,NounPPFrame,range,domain,1,dbo:birthYear,dbo:Person,xsd:gYear,"What (xsd:gYear, X) is the birth year/- of (dbo:Person,Y?) ",SELECT ?X WHERE { Y dbo:birthYear ?X.},FALSE,FALSE,"List the (xsd:gYear, X) - of (dbo:Person,Y?) ",SELECT ?X WHERE { Y dbo:birthYear ?X.},"the birth year of (dbo:Person,Y) ",,2,
causeOfDeath_of,noun,cause of death,causes of death,of ,NounPPFrame,range,domain,1,dbo:deathCause,dbo:Person,owl:Thing,"What (owl:Thing, X) is the cause of death/causes of death of  (dbo:Person,Y?) ",SELECT ?X WHERE { Y dbo:deathCause ?X.},FALSE,FALSE,"List the (owl:Thing, X) causes of death of  (dbo:Person,Y?) ",SELECT ?X WHERE { Y dbo:deathCause ?X.},"the cause of death of  (dbo:Person,Y) ",,2,
child_of,noun,child,children,of ,NounPPFrame,range,domain,1,dbo:child,dbo:Person,dbo:Person,"What (dbo:Person, X) is the child/children of  (dbo:Person,Y?) ",SELECT ?X WHERE { Y dbo:child ?X.},"Who (dbo:Person, X) is the child of  (dbo:Person,Y?) (X dbo:child Y)",SELECT ?X WHERE { Y dbo:child ?X.},"List the (dbo:Person, X) children of  (dbo:Person,Y?) ",SELECT ?X WHERE { Y dbo:child ?X.},"the child of  (dbo:Person,Y) ",,2,
cost_of,noun,cost,-,of,NounPPFrame,range,domain,1,dbo:budget,dbo:Film,xsd:double,"What (xsd:double, X) is the cost/- of (dbo:Film,Y?) ",SELECT ?X WHERE { Y dbo:budget ?X.},FALSE,FALSE,"List the (xsd:double, X) - of (dbo:Film,Y?) ",SELECT ?X WHERE { Y dbo:budget ?X.},"the cost of (dbo:Film,Y) ",,2,
currency_of,noun,currency,currencies,of,NounPPFrame,range,domain,1,dbo:currency,dbo:Country,dbo:Currency,"What (dbo:Currency, X) is the currency/currencies of (dbo:Country,Y?) ",SELECT ?X WHERE { Y dbo:currency ?X.},FALSE,FALSE,"List the (dbo:Currency, X) currencies of (dbo:Country,Y?) ",SELECT ?X WHERE { Y dbo:currency ?X.},"the currency of (dbo:Country,Y) ",,2,
deathDate-of,noun,death date,-,of,NounPPFrame,range,domain,1,dbo:deathDate,dbo:Person,xsd:date,"What (xsd:date, X) is the death date/- of (dbo:Person,Y?) ",SELECT ?X WHERE { Y dbo:deathDate ?X.},FALSE,FALSE,"List the (xsd:date, X) - of (dbo:Person,Y?) ",SELECT ?X WHERE { Y dbo:deathDate ?X.},"the death date of (dbo:Person,Y) ",,2,
developer_of,noun,developer,developers,of,NounPPFrame,range,domain,1,dbo:developer,dbo:Work,dbo:Agent,"What (dbo:Agent, X) is the developer/developers of (dbo:Work,Y?) ",SELECT ?X WHERE { Y dbo:developer ?X.},FALSE,FALSE,"List the (dbo:Agent, X) developers of (dbo:Work,Y?) ",SELECT ?X WHERE { Y dbo:developer ?X.},"the developer of (dbo:Work,Y) ",,2,
dissolutionDate_of,noun,dissolution date,-,of,NounPPFrame,range,domain,1,dbo:dissolutionDate,dbo:PopulatedPlace,xsd:date,"What (xsd:date, X) is the dissolution date/- of (dbo:PopulatedPlace,Y?) ",SELECT ?X WHERE { Y dbo:dissolutionDate ?X.},FALSE,FALSE,"List the (xsd:date, X) - of (dbo:PopulatedPlace,Y?) ",SELECT ?X WHERE { Y dbo:dissolutionDate ?X.},"the dissolution date of (dbo:PopulatedPlace,Y) ",,2,
doctoralSupervisor_of,noun,doctoral supervisor,doctoral supervisors,of,NounPPFrame,range,domain,1,dbo: doctoralAdvisor,dbo:Scientist,dbo:Person,"What (dbo:Person, X) is the doctoral supervisor/doctoral supervisors of (dbo:Scientist,Y?) ",SELECT ?X WHERE { Y dbo: doctoralAdvisor ?X.},"Who (dbo:Person, X) is the doctoral supervisor of (dbo:Scientist,Y?) (X dbo: doctoralAdvisor Y)",SELECT ?X WHERE { Y dbo: doctoralAdvisor ?X.},"List the (dbo:Person, X) doctoral supervisors of (dbo:Scientist,Y?) ",SELECT ?X WHERE { Y dbo: doctoralAdvisor ?X.},"the doctoral supervisor of (dbo:Scientist,Y) ",,2,
episode_of,noun,episode,episodes,of,NounPPFrame,range,domain,1,dbo:series,dbo:TelevisionEpisode,dbo:TelevisionShow,"What (dbo:TelevisionShow, X) is the episode/episodes of (dbo:TelevisionEpisode,Y?) ",SELECT ?X WHERE { Y dbo:series ?X.},FALSE,FALSE,"List the (dbo:TelevisionShow, X) episodes of (dbo:TelevisionEpisode,Y?) ",SELECT ?X WHERE { Y dbo:series ?X.},"the episode of (dbo:TelevisionEpisode,Y) ",,2,
foundationPlace_of,noun,foundation place,-,of,NounPPFrame,range,domain,1,dbo:foundationPlace,dbo:Organisation,dbo:City,"What (dbo:City, X) is the foundation place/- of (dbo:Organisation,Y?) ",SELECT ?X WHERE { Y dbo:foundationPlace ?X.},FALSE,FALSE,"List the (dbo:City, X) - of (dbo:Organisation,Y?) ",SELECT ?X WHERE { Y dbo:foundationPlace ?X.},"the foundation place of (dbo:Organisation,Y) ",,2,
founder_of,noun,founder,founders,of,NounPPFrame,range,domain,1,dbo:parentCompany,dbo:Company,dbo:Company,"What (dbo:Company, X) is the founder/founders of (dbo:Company,Y?) ",SELECT ?X WHERE { Y dbo:parentCompany ?X.},FALSE,FALSE,"List the (dbo:Company, X) founders of (dbo:Company,Y?) ",SELECT ?X WHERE { Y dbo:parentCompany ?X.},"the founder of (dbo:Company,Y) ",,2,
foundingYear_of,noun,founding year,-,of,NounPPFrame,range,domain,1,dbo:foundingYear,dbo:Company,xsd:gYear,"What (xsd:gYear, X) is the founding year/- of (dbo:Company,Y?) ",SELECT ?X WHERE { Y dbo:foundingYear ?X.},FALSE,FALSE,"List the (xsd:gYear, X) - of (dbo:Company,Y?) ",SELECT ?X WHERE { Y dbo:foundingYear ?X.},"the founding year of (dbo:Company,Y) ",,2,
headquarter_of,noun,headquarter,-,of,NounPPFrame,range,domain,1,dbo:headquarter,dbo:Organisation,dbo:PopulatedPlace,"What (dbo:PopulatedPlace, X) is the headquarter/- of (dbo:Organisation,Y?) ",SELECT ?X WHERE { Y dbo:headquarter ?X.},FALSE,FALSE,"List the (dbo:PopulatedPlace, X) - of (dbo:Organisation,Y?) ",SELECT ?X WHERE { Y dbo:headquarter ?X.},"the headquarter of (dbo:Organisation,Y) ",,2,
homeStadium_of,noun,home stadium,home stadiums,of,NounPPFrame,range,domain,1,dbo:ground,dbo:SoccerClub,dbo:Building,"What (dbo:Building, X) is the home stadium/home stadiums of (dbo:SoccerClub,Y?) ",SELECT ?X WHERE { Y dbo:ground ?X.},FALSE,FALSE,"List the (dbo:Building, X) home stadiums of (dbo:SoccerClub,Y?) ",SELECT ?X WHERE { Y dbo:ground ?X.},"the home stadium of (dbo:SoccerClub,Y) ",,2,
host_of,noun,host,hosts,of,NounPPFrame,range,domain,1,dbo:presenter,dbo:TelevisionShow,dbo:Person,"What (dbo:Person, X) is the host/hosts of (dbo:TelevisionShow,Y?) ",SELECT ?X WHERE { Y dbo:presenter ?X.},"Who (dbo:Person, X) is the host of (dbo:TelevisionShow,Y?) (X dbo:presenter Y)",SELECT ?X WHERE { Y dbo:presenter ?X.},"List the (dbo:Person, X) hosts of (dbo:TelevisionShow,Y?) ",SELECT ?X WHERE { Y dbo:presenter ?X.},"the host of (dbo:TelevisionShow,Y) ",,2,
influencer_of,noun,influencer,influencers,of,NounPPFrame,range,domain,1,dbo:influenced,dbo:Person,dbo:Person,"What (dbo:Person, X) is the influencer/influencers of (dbo:Person,Y?) ",SELECT ?X WHERE { Y dbo:influenced ?X.},"Who (dbo:Person, X) is the influencer of (dbo:Person,Y?) (X dbo:influenced Y)",SELECT ?X WHERE { Y dbo:influenced ?X.},"List the (dbo:Person, X) influencers of (dbo:Person,Y?) ",SELECT ?X WHERE { Y dbo:influenced ?X.},"the influencer of (dbo:Person,Y) ",,2,
ingredient_of,noun,ingredient,ingredients,of,NounPPFrame,range,domain,1,dbo:ingredient,dbo:Food,owl:Thing,"What (owl:Thing, X) is the ingredient/ingredients of (dbo:Food,Y?) ",SELECT ?X WHERE { Y dbo:ingredient ?X.},FALSE,FALSE,"List the (owl:Thing, X) ingredients of (dbo:Food,Y?) ",SELECT ?X WHERE { Y dbo:ingredient ?X.},"the ingredient of (dbo:Food,Y) ",,2,
largestCity_of,noun,largest city,-,of,NounPPFrame,range,domain,1,dbo:largestCity,dbo:Country,dbo:City,"What (dbo:City, X) is the largest city/- of (dbo:Country,Y?) ",SELECT ?X WHERE { Y dbo:largestCity ?X.},FALSE,FALSE,"List the (dbo:City, X) - of (dbo:Country,Y?) ",SELECT ?X WHERE { Y dbo:largestCity ?X.},"the largest city of (dbo:Country,Y) ",,2,
-,noun,largest city,-,in,NounPPFrame,range,domain,1,dbo:largestCity,dbo:Country,dbo:City,"What (dbo:City, X) is the largest city/- in (dbo:Country,Y?) ",SELECT ?X WHERE { Y dbo:largestCity ?X.},FALSE,FALSE,"List the (dbo:City, X) - in (dbo:Country,Y?) ",SELECT ?X WHERE { Y dbo:largestCity ?X.},"the largest city in (dbo:Country,Y) ",,2,
leader-of,noun,leader,-,of,NounPPFrame,range,domain,1,dbo:leader,dbo:Country,dbo:Person,"What (dbo:Person, X) is the leader/- of (dbo:Country,Y?) ",SELECT ?X WHERE { Y dbo:leader ?X.},"Who (dbo:Person, X) is the leader of (dbo:Country,Y?) (X dbo:leader Y)",SELECT ?X WHERE { Y dbo:leader ?X.},"List the (dbo:Person, X) - of (dbo:Country,Y?) ",SELECT ?X WHERE { Y dbo:leader ?X.},"the leader of (dbo:Country,Y) ",,2,
location-of,noun,location,-,of,NounPPFrame,range,domain,1,dbo:location,dbo:Place,dbo:Place,"What (dbo:Place, X) is the location/- of (dbo:Place,Y?) ",SELECT ?X WHERE { Y dbo:location ?X.},FALSE,FALSE,"List the (dbo:Place, X) - of (dbo:Place,Y?) ",SELECT ?X WHERE { Y dbo:location ?X.},"the location of (dbo:Place,Y) ",,2,
-,noun,location,-,of,NounPPFrame,range,domain,1,dbo:location,dbo:Organisation,dbo:Place,"What (dbo:Place, X) is the location/- of (dbo:Organisation,Y?) ",SELECT ?X WHERE { Y dbo:location ?X.},FALSE,FALSE,"List the (dbo:Place, X) - of (dbo:Organisation,Y?) ",SELECT ?X WHERE { Y dbo:location ?X.},"the location of (dbo:Organisation,Y) ",,2,
-,noun,location,-,of,NounPPFrame,range,domain,1,dbo:location,dbo:Building,dbo:Place,"What (dbo:Place, X) is the location/- of (dbo:Building,Y?) ",SELECT ?X WHERE { Y dbo:location ?X.},FALSE,FALSE,"List the (dbo:Place, X) - of (dbo:Building,Y?) ",SELECT ?X WHERE { Y dbo:location ?X.},"the location of (dbo:Building,Y) ",,2,
manufacturer-of,noun,manufacturer,manufacturers,of,NounPPFrame,range,domain,1,dbo:manufacturer,owl:Thing,dbo:Organisation,"What (dbo:Organisation, X) is the manufacturer/manufacturers of (owl:Thing,Y?) ",SELECT ?X WHERE { Y dbo:manufacturer ?X.},FALSE,FALSE,"List the (dbo:Organisation, X) manufacturers of (owl:Thing,Y?) ",SELECT ?X WHERE { Y dbo:manufacturer ?X.},"the manufacturer of (owl:Thing,Y) ",,2,
mayor_of,noun,mayor,-,of,NounPPFrame,range,domain,1,dbo:mayor,dbo:City,dbo:Person,"What (dbo:Person, X) is the mayor/- of (dbo:City,Y?) ",SELECT ?X WHERE { Y dbo:mayor ?X.},"Who (dbo:Person, X) is the mayor of (dbo:City,Y?) (X dbo:mayor Y)",SELECT ?X WHERE { Y dbo:mayor ?X.},"List the (dbo:Person, X) - of (dbo:City,Y?) ",SELECT ?X WHERE { Y dbo:mayor ?X.},"the mayor of (dbo:City,Y) ",,2,
almaMater-of,noun,Alma Mater,Alma Maters,of,NounPPFrame,range,domain,1,dbo:almaMater,dbo:Person,dbo:EducationalInstitution,"What (dbo:EducationalInstitution, X) is the Alma Mater/Alma Maters of (dbo:Person,Y?) ",SELECT ?X WHERE { Y dbo:almaMater ?X.},FALSE,FALSE,"List the (dbo:EducationalInstitution, X) Alma Maters of (dbo:Person,Y?) ",SELECT ?X WHERE { Y dbo:almaMater ?X.},"the Alma Mater of (dbo:Person,Y) ",,2,
destination-of,noun,destination,destinations,of,NounPPFrame,range,domain,1,dbo:destination,dbo:PublicTransitSystem,dbo:PopulatedPlace,"What (dbo:PopulatedPlace, X) is the destination/destinations of (dbo:PublicTransitSystem,Y?) ",SELECT ?X WHERE { Y dbo:destination ?X.},FALSE,FALSE,"List the (dbo:PopulatedPlace, X) destinations of (dbo:PublicTransitSystem,Y?) ",SELECT ?X WHERE { Y dbo:destination ?X.},"the destination of (dbo:PublicTransitSystem,Y) ",,2,
-,noun,destination,destinations,of,NounPPFrame,range,domain,2,dbo:destination,dbo:Airplane,dbo:PopulatedPlace,"What (dbo:PopulatedPlace, X) is the destination/destinations of (dbo:Airplane,Y?) ",SELECT ?X WHERE { Y dbo:destination ?X.},FALSE,FALSE,"List the (dbo:PopulatedPlace, X) destinations of (dbo:Airplane,Y?) ",SELECT ?X WHERE { Y dbo:destination ?X.},"the destination of (dbo:Airplane,Y) ",,2,
distributor-of,noun,distributor,distributors,of,NounPPFrame,range,domain,1,dbo:distributor,dbo:Film,dbo:Organisation,"What (dbo:Organisation, X) is the distributor/distributors of (dbo:Film,Y?) ",SELECT ?X WHERE { Y dbo:distributor ?X.},FALSE,FALSE,"List the (dbo:Organisation, X) distributors of (dbo:Film,Y?) ",SELECT ?X WHERE { Y dbo:distributor ?X.},"the distributor of (dbo:Film,Y) ",,2,
