LemonEntry,partOfSpeech,writtenForm (singular),writtenForm (plural),preposition,SyntacticFrame,copulativeArg,prepositionalAdjunct,sense,reference,domain,range,GrammarRule1:question1,SPARQL,GrammarRule1: question2,SPARQL Question 2,GrammarRule 1: questions,SPARQL ,NP (Grammar Rule 2),,grammar rules,numberOfQuestions
numberOfUndergraduateStudents,noun,number of undergraduate students,-,of,NounPPFrame,range,domain,1,dbo:numberOfUndergraduateStudents,dbo:EducationalInstitution,xsd:nonNegativeInteger,"What (xsd:nonNegativeInteger, X) is the number of undergraduate students/- of (dbo:EducationalInstitution,Y?) ",SELECT ?X WHERE { Y dbo:numberOfUndergraduateStudents ?X.},FALSE,FALSE,"List the (xsd:nonNegativeInteger, X) - of (dbo:EducationalInstitution,Y?) ",SELECT ?X WHERE { Y dbo:numberOfUndergraduateStudents ?X.},"the number of undergraduate students of (dbo:EducationalInstitution,Y) ",,,
numberOfStaff,noun,number of staff,-,of,NounPPFrame,range,domain,1,dbo:staff,dbo:Organisation,xsd:nonNegativeInteger,"What (xsd:nonNegativeInteger, X) is the number of staff/- of (dbo:Organisation,Y?) ",SELECT ?X WHERE { Y dbo:staff ?X.},FALSE,FALSE,"List the (xsd:nonNegativeInteger, X) - of (dbo:Organisation,Y?) ",SELECT ?X WHERE { Y dbo:staff ?X.},"the number of staff of (dbo:Organisation,Y) ",,,
officialSchoolColour-of,noun,official school colour,-,of,NounPPFrame,range,domain,1,dbo:officialSchoolColour,dbo:EducationalInstitution,xsd:string,"What (xsd:string, X) is the official school colour/- of (dbo:EducationalInstitution,Y?) ",SELECT ?X WHERE { Y dbo:officialSchoolColour ?X.},FALSE,FALSE,"List the (xsd:string, X) - of (dbo:EducationalInstitution,Y?) ",SELECT ?X WHERE { Y dbo:officialSchoolColour ?X.},"the official school colour of (dbo:EducationalInstitution,Y) ",,,
deputy-of,noun,deputy,-,of,NounPPFrame,range,domain,1,dbo:deputy,dbo:Person,xsd:string,"What (xsd:string, X) is the deputy/- of (dbo:Person,Y?) ",SELECT ?X WHERE { Y dbo:deputy ?X.},FALSE,FALSE,"List the (xsd:string, X) - of (dbo:Person,Y?) ",SELECT ?X WHERE { Y dbo:deputy ?X.},"the deputy of (dbo:Person,Y) ",,,
office-of,noun ,office,-,of,NounPPFrame,range,domain,1,dbo:office,dbo:Politician,xsd:string,"What (xsd:string, X) is the office/- of (dbo:Politician,Y?) ",SELECT ?X WHERE { Y dbo:office ?X.},FALSE,FALSE,"List the (xsd:string, X) - of (dbo:Politician,Y?) ",SELECT ?X WHERE { Y dbo:office ?X.},"the office of (dbo:Politician,Y) ",,,
otherParty-of,noun,other party,other parties,of,NounPPFrame,range,domain,1,dbo:otherParty,dbo:Politician,xsd:string,"What (xsd:string, X) is the other party/other parties of (dbo:Politician,Y?) ",SELECT ?X WHERE { Y dbo:otherParty ?X.},FALSE,FALSE,"List the (xsd:string, X) other parties of (dbo:Politician,Y?) ",SELECT ?X WHERE { Y dbo:otherParty ?X.},"the other party of (dbo:Politician,Y) ",,,
party-of,noun,party,parties,of,NounPPFrame,range,domain,1,dbo:party,dbo:Politician,xsd:string,"What (xsd:string, X) is the party/parties of (dbo:Politician,Y?) ",SELECT ?X WHERE { Y dbo:party ?X.},FALSE,FALSE,"List the (xsd:string, X) parties of (dbo:Politician,Y?) ",SELECT ?X WHERE { Y dbo:party ?X.},"the party of (dbo:Politician,Y) ",,,
notableWork-of,noun,notable work,notable works,of,NounPPFrame,range,domain,1,dbo:notableWork,dbo:Writer,xsd:string,"What (xsd:string, X) is the notable work/notable works of (dbo:Writer,Y?) ",SELECT ?X WHERE { Y dbo:notableWork ?X.},FALSE,FALSE,"List the (xsd:string, X) notable works of (dbo:Writer,Y?) ",SELECT ?X WHERE { Y dbo:notableWork ?X.},"the notable work of (dbo:Writer,Y) ",,,
-,noun,notable work,notable works,of,NounPPFrame,range,domain,2,dbo:notableWork,dbo:Artist,dbo:Work,"What (dbo:Work, X) is the notable work/notable works of (dbo:Artist,Y?) ",SELECT ?X WHERE { Y dbo:notableWork ?X.},FALSE,FALSE,"List the (dbo:Work, X) notable works of (dbo:Artist,Y?) ",SELECT ?X WHERE { Y dbo:notableWork ?X.},"the notable work of (dbo:Artist,Y) ",,,
pseudonym-of,noun,pseudonym,pseudonyms,of,NounPPFrame,range,domain,1,dbo:pseudonym,dbo:Writer,xsd:string,"What (xsd:string, X) is the pseudonym/pseudonyms of (dbo:Writer,Y?) ",SELECT ?X WHERE { Y dbo:pseudonym ?X.},FALSE,FALSE,"List the (xsd:string, X) pseudonyms of (dbo:Writer,Y?) ",SELECT ?X WHERE { Y dbo:pseudonym ?X.},"the pseudonym of (dbo:Writer,Y) ",,,
restingPlace-of,noun,resting place,-,of,NounPPFrame,range,domain,1,dbo:restingPlace,dbo:Person,xsd:string,"What (xsd:string, X) is the resting place/- of (dbo:Person,Y?) ",SELECT ?X WHERE { Y dbo:restingPlace ?X.},FALSE,FALSE,"List the (xsd:string, X) - of (dbo:Person,Y?) ",SELECT ?X WHERE { Y dbo:restingPlace ?X.},"the resting place of (dbo:Person,Y) ",,,
company-of,noun,company ,companies,of,NounPPFrame,range,domain,1,dbo:company,dbo:TelevisionShow,xsd:string,"What (xsd:string, X) is the company /companies of (dbo:TelevisionShow,Y?) ",SELECT ?X WHERE { Y dbo:company ?X.},FALSE,FALSE,"List the (xsd:string, X) companies of (dbo:TelevisionShow,Y?) ",SELECT ?X WHERE { Y dbo:company ?X.},"the company  of (dbo:TelevisionShow,Y) ",,,
creator-of,noun,creator,-,of,NounPPFrame,range,domain,1,dbo:creator,dbo:TelevisionShow,dbo:Person,"What (dbo:Person, X) is the creator/- of (dbo:TelevisionShow,Y?) ",SELECT ?X WHERE { Y dbo:creator ?X.},"Which person,Who (dbo:Person, X) is,was the creator of (dbo:TelevisionShow,Y?) (X dbo:creator Y)",SELECT ?X WHERE { Y dbo:creator ?X.},"List the (dbo:Person, X) - of (dbo:TelevisionShow,Y?) ",SELECT ?X WHERE { Y dbo:creator ?X.},"the creator of (dbo:TelevisionShow,Y) ",,,
distributor-of,noun,distributor,distributors,of,NounPPFrame,range,domain,2,dbo:distributor,dbo:TelevisionShow,xsd:string,"What (xsd:string, X) is the distributor/distributors of (dbo:TelevisionShow,Y?) ",SELECT ?X WHERE { Y dbo:distributor ?X.},FALSE,FALSE,"List the (xsd:string, X) distributors of (dbo:TelevisionShow,Y?) ",SELECT ?X WHERE { Y dbo:distributor ?X.},"the distributor of (dbo:TelevisionShow,Y) ",,,
imdbld-of,noun,imdbld,-,of,NounPPFrame,range,domain,1,dbo:imdbld,dbo:TelevisionShow,xsd:Integer,"What (xsd:Integer, X) is the imdbld/- of (dbo:TelevisionShow,Y?) ",SELECT ?X WHERE { Y dbo:imdbld ?X.},FALSE,FALSE,"List the (xsd:Integer, X) - of (dbo:TelevisionShow,Y?) ",SELECT ?X WHERE { Y dbo:imdbld ?X.},"the imdbld of (dbo:TelevisionShow,Y) ",,,
network-of,noun,network,networks,of,NounPPFrame,range,domain,1,dbo:network,dbo:TelevisionShow,xsd:string,"What (xsd:string, X) is the network/networks of (dbo:TelevisionShow,Y?) ",SELECT ?X WHERE { Y dbo:network ?X.},FALSE,FALSE,"List the (xsd:string, X) networks of (dbo:TelevisionShow,Y?) ",SELECT ?X WHERE { Y dbo:network ?X.},"the network of (dbo:TelevisionShow,Y) ",,,
numberOfEpisodes-of,noun,number of episodes,-,of,NounPPFrame,range,domain,1,dbo:numberOfEpisodes,dbo:TelevisionShow,xsd:integer,"What (xsd:integer, X) is the number of episodes/- of (dbo:TelevisionShow,Y?) ",SELECT ?X WHERE { Y dbo:numberOfEpisodes ?X.},FALSE,FALSE,"List the (xsd:integer, X) - of (dbo:TelevisionShow,Y?) ",SELECT ?X WHERE { Y dbo:numberOfEpisodes ?X.},"the number of episodes of (dbo:TelevisionShow,Y) ",,,
numberOfSeasons-of,noun,number of seasons,-,of,NounPPFrame,range,domain,1,dbo:numberOfSeasons,dbo:TelevisionShow,xsd:integer,"What (xsd:integer, X) is the number of seasons/- of (dbo:TelevisionShow,Y?) ",SELECT ?X WHERE { Y dbo:numberOfSeasons ?X.},FALSE,FALSE,"List the (xsd:integer, X) - of (dbo:TelevisionShow,Y?) ",SELECT ?X WHERE { Y dbo:numberOfSeasons ?X.},"the number of seasons of (dbo:TelevisionShow,Y) ",,,
presenter-of,noun,presenter,presenters,of,NounPPFrame,range,domain,1,dbo:presenter,dbo:TelevisionShow,dbo:Person,"What (dbo:Person, X) is the presenter/presenters of (dbo:TelevisionShow,Y?) ",SELECT ?X WHERE { Y dbo:presenter ?X.},"Which person,Who (dbo:Person, X) is,was the presenter of (dbo:TelevisionShow,Y?) (X dbo:presenter Y)",SELECT ?X WHERE { Y dbo:presenter ?X.},"List the (dbo:Person, X) presenters of (dbo:TelevisionShow,Y?) ",SELECT ?X WHERE { Y dbo:presenter ?X.},"the presenter of (dbo:TelevisionShow,Y) ",,,
riverMouth-of,noun,river mouth,-,of,NounPPFrame,range,domain,1,dbo:riverMouth,dbo:River,dbo:Sea,"What (dbo:Sea, X) is the river mouth/- of (dbo:River,Y?) ",SELECT ?X WHERE { Y dbo:riverMouth ?X.},FALSE,FALSE,"List the (dbo:Sea, X) - of (dbo:River,Y?) ",SELECT ?X WHERE { Y dbo:riverMouth ?X.},"the river mouth of (dbo:River,Y) ",,,
mouthLevel-of,noun,mouth level,-,of,NounPPFrame,range,domain,1,dbp:mouthLevel,dbo:River,xsd:string,"What (xsd:string, X) is the mouth level/- of (dbo:River,Y?) ",SELECT ?X WHERE { Y dbp:mouthLevel ?X.},FALSE,FALSE,"List the (xsd:string, X) - of (dbo:River,Y?) ",SELECT ?X WHERE { Y dbp:mouthLevel ?X.},"the mouth level of (dbo:River,Y) ",,,
humanDevelopementIndex-of,noun,human developement index,-,of,NounPPFrame,range,domain,1,dbo:humanDevelopementIndex,dbo:Country,xsd:float,"What (xsd:float, X) is the human developement index/- of (dbo:Country,Y?) ",SELECT ?X WHERE { Y dbo:humanDevelopementIndex ?X.},FALSE,FALSE,"List the (xsd:float, X) - of (dbo:Country,Y?) ",SELECT ?X WHERE { Y dbo:humanDevelopementIndex ?X.},"the human developement index of (dbo:Country,Y) ",,,
religion-of,noun,religion ,religions,of,NounPPFrame,range,domain,1,dbo:religion,dbo:Country,xsd:string,"What (xsd:string, X) is the religion /religions of (dbo:Country,Y?) ",SELECT ?X WHERE { Y dbo:religion ?X.},FALSE,FALSE,"List the (xsd:string, X) religions of (dbo:Country,Y?) ",SELECT ?X WHERE { Y dbo:religion ?X.},"the religion  of (dbo:Country,Y) ",,,
cinematography-of,noun,cinematography,-,of,NounPPFrame,range,domain,1,dbo:cinematography,dbo:Film,dbo:Person,"What (dbo:Person, X) is the cinematography/- of (dbo:Film,Y?) ",SELECT ?X WHERE { Y dbo:cinematography ?X.},"Which person,Who (dbo:Person, X) is,was the cinematography of (dbo:Film,Y?) (X dbo:cinematography Y)",SELECT ?X WHERE { Y dbo:cinematography ?X.},"List the (dbo:Person, X) - of (dbo:Film,Y?) ",SELECT ?X WHERE { Y dbo:cinematography ?X.},"the cinematography of (dbo:Film,Y) ",,,
designer-of,noun,designer,-,of,NounPPFrame,range,domain,1,dbo:designer,dbo:Work,dbo:Person,"What (dbo:Person, X) is the designer/- of (dbo:Work,Y?) ",SELECT ?X WHERE { Y dbo:designer ?X.},"Which person,Who (dbo:Person, X) is,was the designer of (dbo:Work,Y?) (X dbo:designer Y)",SELECT ?X WHERE { Y dbo:designer ?X.},"List the (dbo:Person, X) - of (dbo:Work,Y?) ",SELECT ?X WHERE { Y dbo:designer ?X.},"the designer of (dbo:Work,Y) ",,,
gameArtist-of,noun,game artist,-,of,NounPPFrame,range,domain,1,dbo:gameArtist,dbo:VideoGame,dbo:Person,"What (dbo:Person, X) is the game artist/- of (dbo:VideoGame,Y?) ",SELECT ?X WHERE { Y dbo:gameArtist ?X.},"Which person,Who (dbo:Person, X) is,was the game artist of (dbo:VideoGame,Y?) (X dbo:gameArtist Y)",SELECT ?X WHERE { Y dbo:gameArtist ?X.},"List the (dbo:Person, X) - of (dbo:VideoGame,Y?) ",SELECT ?X WHERE { Y dbo:gameArtist ?X.},"the game artist of (dbo:VideoGame,Y) ",,,
field-of,noun,field,fields,of,NounPPFrame,range,domain,1,dbo:field,dbo:Artist,dbo:PersonFunction,"What (dbo:PersonFunction, X) is the field/fields of (dbo:Artist,Y?) ",SELECT ?X WHERE { Y dbo:field ?X.},FALSE,FALSE,"List the (dbo:PersonFunction, X) fields of (dbo:Artist,Y?) ",SELECT ?X WHERE { Y dbo:field ?X.},"the field of (dbo:Artist,Y) ",,,
birthName-of,noun,birth name ,birth names,of,NounPPFrame,range,domain,1,dbo:birthName,dbo:Person,rdf:langString,"What (rdf:langString, X) is the birth name /birth names of (dbo:Person,Y?) ",SELECT ?X WHERE { Y dbo:birthName ?X.},FALSE,FALSE,"List the (rdf:langString, X) birth names of (dbo:Person,Y?) ",SELECT ?X WHERE { Y dbo:birthName ?X.},"the birth name  of (dbo:Person,Y) ",,,
location-of,noun,location,locations,of,NounPPFrame,range,domain,1,dbo:location,dbo:BodyOfWater,dbo:Place,"What (dbo:Place, X) is the location/locations of (dbo:BodyOfWater,Y?) ",SELECT ?X WHERE { Y dbo:location ?X.},FALSE,FALSE,"List the (dbo:Place, X) locations of (dbo:BodyOfWater,Y?) ",SELECT ?X WHERE { Y dbo:location ?X.},"the location of (dbo:BodyOfWater,Y) ",,,
island-of,noun,island,islands,of,NounPPFrame,range,domain,1,dbo:island,dbo:BodyOfWater,dbo:Island,"What (dbo:Island, X) is the island/islands of (dbo:BodyOfWater,Y?) ",SELECT ?X WHERE { Y dbo:island ?X.},FALSE,FALSE,"List the (dbo:Island, X) islands of (dbo:BodyOfWater,Y?) ",SELECT ?X WHERE { Y dbo:island ?X.},"the island of (dbo:BodyOfWater,Y) ",,,
originalName-of,noun,original name,-,of,NounPPFrame,range,domain,1,dbo:originalName,dbo:Company,rdf:langString,"What (rdf:langString, X) is the original name/- of (dbo:Company,Y?) ",SELECT ?X WHERE { Y dbo:originalName ?X.},FALSE,FALSE,"List the (rdf:langString, X) - of (dbo:Company,Y?) ",SELECT ?X WHERE { Y dbo:originalName ?X.},"the original name of (dbo:Company,Y) ",,,
founder-of,noun,founder,founders,of,NounPPFrame,range,domain,1,dbo:foundedBy,dbo:Company,dbo:Agent,"What (dbo:Agent, X) is the founder/founders of (dbo:Company,Y?) ",SELECT ?X WHERE { Y dbo:foundedBy ?X.},FALSE,FALSE,"List the (dbo:Agent, X) founders of (dbo:Company,Y?) ",SELECT ?X WHERE { Y dbo:foundedBy ?X.},"the founder of (dbo:Company,Y) ",,,
discharge_of,noun,discharge,discharges,of,NounPPFrame,range,domain,1,dbo:discharge,dbo:Stream,xsd:double,"What (xsd:double, X) is the discharge/discharges of (dbo:Stream,Y?) ",SELECT ?X WHERE { Y dbo:discharge ?X.},FALSE,FALSE,"List the (xsd:double, X) discharges of (dbo:Stream,Y?) ",SELECT ?X WHERE { Y dbo:discharge ?X.},"the discharge of (dbo:Stream,Y) ",,binding list,
hometown-of,noun,hometown,-,of,NounPPFrame,range,domain,1,dbo:hometown,dbo:Person,dbo:Settlement,"What (dbo:Settlement, X) is the hometown/- of (dbo:Person,Y?) ",SELECT ?X WHERE { Y dbo:hometown ?X.},FALSE,FALSE,"List the (dbo:Settlement, X) - of (dbo:Person,Y?) ",SELECT ?X WHERE { Y dbo:hometown ?X.},"the hometown of (dbo:Person,Y) ",,,
rightTributary_of,noun,right tributary,right tributaries,of,NounPPFrame,range,domain,1,dbo:rightTributary,dbo:River,dbo:River,"What (dbo:River, X) is the right tributary/right tributaries of (dbo:River,Y?) ",SELECT ?X WHERE { Y dbo:rightTributary ?X.},FALSE,FALSE,"List the (dbo:River, X) right tributaries of (dbo:River,Y?) ",SELECT ?X WHERE { Y dbo:rightTributary ?X.},"the right tributary of (dbo:River,Y) ",,,
sourceCountry_of,noun,source country,source countries,of,NounPPFrame,range,domain,1,dbo:sourceCountry,dbo:Stream,dbo:Country,"What (dbo:Country, X) is the source country/source countries of (dbo:Stream,Y?) ",SELECT ?X WHERE { Y dbo:sourceCountry ?X.},FALSE,FALSE,"List the (dbo:Country, X) source countries of (dbo:Stream,Y?) ",SELECT ?X WHERE { Y dbo:sourceCountry ?X.},"the source country of (dbo:Stream,Y) ",,,
mouthCountry_of,noun,mouth country,mouth countries,of,NounPPFrame,range,domain,1,dbo:mouthCountry,dbo:River,dbo:Country,"What (dbo:Country, X) is the mouth country/mouth countries of (dbo:River,Y?) ",SELECT ?X WHERE { Y dbo:mouthCountry ?X.},FALSE,FALSE,"List the (dbo:Country, X) mouth countries of (dbo:River,Y?) ",SELECT ?X WHERE { Y dbo:mouthCountry ?X.},"the mouth country of (dbo:River,Y) ",,,
sourceElevation_of,noun,source elevation,source elevations,of,NounPPFrame,range,domain,1,dbo:sourceElevation,dbo:River,xsd:double,"What (xsd:double, X) is the source elevation/source elevations of (dbo:River,Y?) ",SELECT ?X WHERE { Y dbo:sourceElevation ?X.},FALSE,FALSE,"List the (xsd:double, X) source elevations of (dbo:River,Y?) ",SELECT ?X WHERE { Y dbo:sourceElevation ?X.},"the source elevation of (dbo:River,Y) ",,,
mouthElevation_of,noun,mouth elevation,mouth elevations,of,NounPPFrame,range,domain,1,dbo:mouthElevation,dbo:River,xsd:double,"What (xsd:double, X) is the mouth elevation/mouth elevations of (dbo:River,Y?) ",SELECT ?X WHERE { Y dbo:mouthElevation ?X.},FALSE,FALSE,"List the (xsd:double, X) mouth elevations of (dbo:River,Y?) ",SELECT ?X WHERE { Y dbo:mouthElevation ?X.},"the mouth elevation of (dbo:River,Y) ",,,
isoCodeRegion-of,noun,ISO code region,-,of,NounPPFrame,range,domain,1,dbo:isoCodeRegion,dbo:Settlement,xsd:string,"What (xsd:string, X) is the ISO code region/- of (dbo:Settlement,Y?) ",SELECT ?X WHERE { Y dbo:isoCodeRegion ?X.},FALSE,FALSE,"List the (xsd:string, X) - of (dbo:Settlement,Y?) ",SELECT ?X WHERE { Y dbo:isoCodeRegion ?X.},"the ISO code region of (dbo:Settlement,Y) ",,,
alias-of,noun,alias,aliases,of,NounPPFrame,range,domain,1,dbo:alias,dbo:Person,rdf:langString,"What (rdf:langString, X) is the alias/aliases of (dbo:Person,Y?) ",SELECT ?X WHERE { Y dbo:alias ?X.},FALSE,FALSE,"List the (rdf:langString, X) aliases of (dbo:Person,Y?) ",SELECT ?X WHERE { Y dbo:alias ?X.},"the alias of (dbo:Person,Y) ",,,
runwayLength-of,noun,runway length,-,of,NounPPFrame,range,domain,1,dbo:runwayLength,dbo:Airport,xsd:double,"What (xsd:double, X) is the runway length/- of (dbo:Airport,Y?) ",SELECT ?X WHERE { Y dbo:runwayLength ?X.},FALSE,FALSE,"List the (xsd:double, X) - of (dbo:Airport,Y?) ",SELECT ?X WHERE { Y dbo:runwayLength ?X.},"the runway length of (dbo:Airport,Y) ",,,
runwayDesignation-of,noun,designation runway,designation runways,of ,NounPPFrame,range,domain,1,dbo:runwayDesignation,dbo:Airport,xsd:string,"What (xsd:string, X) is the designation runway/designation runways of  (dbo:Airport,Y?) ",SELECT ?X WHERE { Y dbo:runwayDesignation ?X.},FALSE,FALSE,"List the (xsd:string, X) designation runways of  (dbo:Airport,Y?) ",SELECT ?X WHERE { Y dbo:runwayDesignation ?X.},"the designation runway of  (dbo:Airport,Y) ",,,
runwaySurface-of,noun,surface runway,surface runways,of,NounPPFrame,range,domain,1,dbo:runwaySurface,dbo:Airport,xsd:string,"What (xsd:string, X) is the surface runway/surface runways of (dbo:Airport,Y?) ",SELECT ?X WHERE { Y dbo:runwaySurface ?X.},FALSE,FALSE,"List the (xsd:string, X) surface runways of (dbo:Airport,Y?) ",SELECT ?X WHERE { Y dbo:runwaySurface ?X.},"the surface runway of (dbo:Airport,Y) ",,,
iataLocationIdentifer-of,noun,IATA Location Identifier,-,of,NounPPFrame,range,domain,1,dbo:iataLocationIdentifier,dbo:Infrastructure,xsd:string,"What (xsd:string, X) is the IATA Location Identifier/- of (dbo:Infrastructure,Y?) ",SELECT ?X WHERE { Y dbo:iataLocationIdentifier ?X.},FALSE,FALSE,"List the (xsd:string, X) - of (dbo:Infrastructure,Y?) ",SELECT ?X WHERE { Y dbo:iataLocationIdentifier ?X.},"the IATA Location Identifier of (dbo:Infrastructure,Y) ",,,
icaoLocationIdentifier-of,noun,ICAO Location Identifier,-,of,NounPPFrame,range,domain,1,dbo:icaoLocationIdentifier,dbo:Airport,xsd:string,"What (xsd:string, X) is the ICAO Location Identifier/- of (dbo:Airport,Y?) ",SELECT ?X WHERE { Y dbo:icaoLocationIdentifier ?X.},FALSE,FALSE,"List the (xsd:string, X) - of (dbo:Airport,Y?) ",SELECT ?X WHERE { Y dbo:icaoLocationIdentifier ?X.},"the ICAO Location Identifier of (dbo:Airport,Y) ",,,
album-of,noun,album,albums,of,NounPPFrame,range,domain,1,dbo:Album,dbo:Work,dbo:Album,"What (dbo:Album, X) is the album/albums of (dbo:Work,Y?) ",SELECT ?X WHERE { Y dbo:Album ?X.},FALSE,FALSE,"List the (dbo:Album, X) albums of (dbo:Work,Y?) ",SELECT ?X WHERE { Y dbo:Album ?X.},"the album of (dbo:Work,Y) ",,,
publisher-of,noun,publisher,publishers,of,NounPPFrame,range,domain,1,dbo:Publisher,dbo:Work,dbo:Agent,"What (dbo:Agent, X) is the publisher/publishers of (dbo:Work,Y?) ",SELECT ?X WHERE { Y dbo:Publisher ?X.},FALSE,FALSE,"List the (dbo:Agent, X) publishers of (dbo:Work,Y?) ",SELECT ?X WHERE { Y dbo:Publisher ?X.},"the publisher of (dbo:Work,Y) ",,,
deweyDecimalClassification,noun,Dewey Decimal Classification,Dewey Decimal Classifications,of,NounPPFrame,range,domain,1,dbo:Dcc,dbo:Work,xsd:string,"What (xsd:string, X) is the Dewey Decimal Classification/Dewey Decimal Classifications of (dbo:Work,Y?) ",SELECT ?X WHERE { Y dbo:Dcc ?X.},FALSE,FALSE,"List the (xsd:string, X) Dewey Decimal Classifications of (dbo:Work,Y?) ",SELECT ?X WHERE { Y dbo:Dcc ?X.},"the Dewey Decimal Classification of (dbo:Work,Y) ",,,
lcc-of,noun,LCC,-,of,NounPPFrame,range,domain,1,dbo:Lcc,dbo:WrittenWork,xsd:string,"What (xsd:string, X) is the LCC/- of (dbo:WrittenWork,Y?) ",SELECT ?X WHERE { Y dbo:Lcc ?X.},FALSE,FALSE,"List the (xsd:string, X) - of (dbo:WrittenWork,Y?) ",SELECT ?X WHERE { Y dbo:Lcc ?X.},"the LCC of (dbo:WrittenWork,Y) ",,,
oclc-of,noun,OCLC,-,of,NounPPFrame,range,domain,1,dbo:Oclc,dbo:WrittenWork,xsd:string,"What (xsd:string, X) is the OCLC/- of (dbo:WrittenWork,Y?) ",SELECT ?X WHERE { Y dbo:Oclc ?X.},FALSE,FALSE,"List the (xsd:string, X) - of (dbo:WrittenWork,Y?) ",SELECT ?X WHERE { Y dbo:Oclc ?X.},"the OCLC of (dbo:WrittenWork,Y) ",,,
headquarter-of,noun,headquarter,-,of,NounPPFrame,range,domain,1,dbo:Headquarter,dbo:Organisation,dbo:PopulatedPlace,"What (dbo:PopulatedPlace, X) is the headquarter/- of (dbo:Organisation,Y?) ",SELECT ?X WHERE { Y dbo:Headquarter ?X.},FALSE,FALSE,"List the (dbo:PopulatedPlace, X) - of (dbo:Organisation,Y?) ",SELECT ?X WHERE { Y dbo:Headquarter ?X.},"the headquarter of (dbo:Organisation,Y) ",,,
ideology-of,noun,ideology,ideologies,of,NounPPFrame,range,domain,1,dbo:Ideology,dbo:Agent,dbo:Ideology,"What (dbo:Ideology, X) is the ideology/ideologies of (dbo:Agent,Y?) ",SELECT ?X WHERE { Y dbo:Ideology ?X.},FALSE,FALSE,"List the (dbo:Ideology, X) ideologies of (dbo:Agent,Y?) ",SELECT ?X WHERE { Y dbo:Ideology ?X.},"the ideology of (dbo:Agent,Y) ",,,
recordLocation-of,noun,record location,record locations,of,NounPPFrame,range,domain,1,dbo:RecordedIn,dbo:MusicalWork,dbo:PopulatedPlace,"What (dbo:PopulatedPlace, X) is the record location/record locations of (dbo:MusicalWork,Y?) ",SELECT ?X WHERE { Y dbo:RecordedIn ?X.},FALSE,FALSE,"List the (dbo:PopulatedPlace, X) record locations of (dbo:MusicalWork,Y?) ",SELECT ?X WHERE { Y dbo:RecordedIn ?X.},"the record location of (dbo:MusicalWork,Y) ",,,
relation-of,noun,relation,relations,of,NounPPFrame,range,domain,1,dbo:relation,dbo:Person,dbo:Person,-,SELECT ?X WHERE { Y dbo:relation ?X.},"Which person,Who (dbo:Person, X) is,was the relation of (dbo:Person,Y?) (X dbo:relation Y)",SELECT ?X WHERE { Y dbo:relation ?X.},"List the (dbo:Person, X) relations of (dbo:Person,Y?) ",SELECT ?X WHERE { Y dbo:relation ?X.},"the relation of (dbo:Person,Y) ",,,
governmentType-of,noun,government type,government types,of,NounPPFrame,range,domain,1,dbo:governmentType,dbo:City,dbo:GovernmentType,"What (dbo:GovernmentType, X) is the government type/government types of (dbo:City,Y?) ",SELECT ?X WHERE { Y dbo:governmentType ?X.},FALSE,FALSE,"List the (dbo:GovernmentType, X) government types of (dbo:City,Y?) ",SELECT ?X WHERE { Y dbo:governmentType ?X.},"the government type of (dbo:City,Y) ",,,
illustrator-of,noun,illustrator,illustrators,of,NounPPFrame,range,domain,1,dbo:Illustrator,dbo:WrittenWork,dbo:Person,"What (dbo:Person, X) is the illustrator/illustrators of (dbo:WrittenWork,Y?) ",SELECT ?X WHERE { Y dbo:Illustrator ?X.},"Which person,Who (dbo:Person, X) is,was the illustrator of (dbo:WrittenWork,Y?) (X dbo:Illustrator Y)",SELECT ?X WHERE { Y dbo:Illustrator ?X.},"List the (dbo:Person, X) illustrators of (dbo:WrittenWork,Y?) ",SELECT ?X WHERE { Y dbo:Illustrator ?X.},"the illustrator of (dbo:WrittenWork,Y) ",,,
isbn-of,noun,ISBN,-,of,NounPPFrame,range,domain,1,dbo:Isbn,dbo:WrittenWork,xsd:string,"What (xsd:string, X) is the ISBN/- of (dbo:WrittenWork,Y?) ",SELECT ?X WHERE { Y dbo:Isbn ?X.},FALSE,FALSE,"List the (xsd:string, X) - of (dbo:WrittenWork,Y?) ",SELECT ?X WHERE { Y dbo:Isbn ?X.},"the ISBN of (dbo:WrittenWork,Y) ",,,
formationYear-of,noun,formation year,-,of,NounPPFrame,range,domain,1,dbo:FormationYear,dbo:Organisation,xsd:gYear,"What (xsd:gYear, X) is the formation year/- of (dbo:Organisation,Y?) ",SELECT ?X WHERE { Y dbo:FormationYear ?X.},FALSE,FALSE,"List the (xsd:gYear, X) - of (dbo:Organisation,Y?) ",SELECT ?X WHERE { Y dbo:FormationYear ?X.},"the formation year of (dbo:Organisation,Y) ",,,
dissolutionYear-of,noun,dissolution year,-,of,NounPPFrame,range,domain,1,dbo:DissolutionYear,"dbo:Organisation,_PopulatedPlace",xsd:year,"What (xsd:year, X) is the dissolution year/- of (dbo:Organisation,_PopulatedPlace,Y?) ",SELECT ?X WHERE { Y dbo:DissolutionYear ?X.},FALSE,FALSE,"List the (xsd:year, X) - of (dbo:Organisation,_PopulatedPlace,Y?) ",SELECT ?X WHERE { Y dbo:DissolutionYear ?X.},"the dissolution year of (dbo:Organisation,_PopulatedPlace,Y) ",,,
actor-of,noun,actor,actors,of,NounPPFrame,range,domain,1,dbo:Actor,dbo:Film,dbo:Person,-,SELECT ?X WHERE { Y dbo:actor ?X.},"Which person,Who (dbo:Person, X) is,was the actor of (dbo:Film,Y?) (X dbo:actor Y)",SELECT ?X WHERE { Y dbo:actor ?X.},"List the (dbo:Person, X) actors of (dbo:Film,Y?) ",SELECT ?X WHERE { Y dbo:actor ?X.},"the actor of (dbo:Film,Y) ",,,
owner-of,noun,owner,owners,of,NounPPFrame,range,domain,1,dbo:owner,dbo:Location,dbo:Agent,-,SELECT ?X WHERE { Y dbo:owner ?X.},FALSE,FALSE,"List the (dbo:Agent, X) owners of (dbo:Location,Y?) ",SELECT ?X WHERE { Y dbo:owner ?X.},"the owner of (dbo:Location,Y) ",,,
politicalLeader-of,noun,political leader,political leaders,of,NounPPFrame,range,domain,1,dbo:politicalLeader,dbo:Place,dbo:PersonFunction,"What (dbo:PersonFunction, X) is the political leader/political leaders of (dbo:Place,Y?) ",SELECT ?X WHERE { Y dbo:politicalLeader ?X.},FALSE,FALSE,"List the (dbo:PersonFunction, X) political leaders of (dbo:Place,Y?) ",SELECT ?X WHERE { Y dbo:politicalLeader ?X.},"the political leader of (dbo:Place,Y) ",,,
picture-of,noun,picture,pictures,of,NounPPFrame,range,domain,1,dbo:picture,dbo:Thing,dbo:Thing,"What (dbo:Thing, X) is the picture/pictures of (dbo:Thing,Y?) ",SELECT ?X WHERE { Y dbo:picture ?X.},FALSE,FALSE,"List the (dbo:Thing, X) pictures of (dbo:Thing,Y?) ",SELECT ?X WHERE { Y dbo:picture ?X.},"the picture of (dbo:Thing,Y) ",,,
termStart-of,noun,starting term,-,of,NounPPFrame,range,domain,1,dbo:termStart,dbo:Person,xsd:integer,"What (xsd:integer, X) is the starting term/- of (dbo:Person,Y?) ",SELECT ?X WHERE { Y dbo:termStart ?X.},FALSE,FALSE,"List the (xsd:integer, X) - of (dbo:Person,Y?) ",SELECT ?X WHERE { Y dbo:termStart ?X.},"the starting term of (dbo:Person,Y) ",,,
termEnd-of,noun,ending term,-,of,NounPPFrame,range,domain,1,dbo:termEnd,dbo:Person,xsd:integer,"What (xsd:integer, X) is the ending term/- of (dbo:Person,Y?) ",SELECT ?X WHERE { Y dbo:termEnd ?X.},FALSE,FALSE,"List the (xsd:integer, X) - of (dbo:Person,Y?) ",SELECT ?X WHERE { Y dbo:termEnd ?X.},"the ending term of (dbo:Person,Y) ",,,
activeYearsStartYear-of,noun,active years start year,-,of,NounPPFrame,range,domain,1,dbo:activeYearsStartYear,dbo:Person,xsd:gYear,"What (xsd:gYear, X) is the active years start year/- of (dbo:Person,Y?) ",SELECT ?X WHERE { Y dbo:activeYearsStartYear ?X.},FALSE,FALSE,"List the (xsd:gYear, X) - of (dbo:Person,Y?) ",SELECT ?X WHERE { Y dbo:activeYearsStartYear ?X.},"the active years start year of (dbo:Person,Y) ",,,
activeYearsEndYear-of,noun,active years end year,-,of,NounPPFrame,range,domain,1,dbo:activeYearsEndYear,dbo:Person,xsd:gYear,"What (xsd:gYear, X) is the active years end year/- of (dbo:Person,Y?) ",SELECT ?X WHERE { Y dbo:activeYearsEndYear ?X.},FALSE,FALSE,"List the (xsd:gYear, X) - of (dbo:Person,Y?) ",SELECT ?X WHERE { Y dbo:activeYearsEndYear ?X.},"the active years end year of (dbo:Person,Y) ",,,
activeYearsEndDate-of,noun,active years end date,-,of,NounPPFrame,range,domain,1,dbo:activeYearsEndDate,dbo:Politician,xsd:date,"What (xsd:date, X) is the active years end date/- of (dbo:Politician,Y?) ",SELECT ?X WHERE { Y dbo:activeYearsEndDate ?X.},FALSE,FALSE,"List the (xsd:date, X) - of (dbo:Politician,Y?) ",SELECT ?X WHERE { Y dbo:activeYearsEndDate ?X.},"the active years end date of (dbo:Politician,Y) ",,,
activeYearsStartDate-of,noun,active years start date,-,of,NounPPFrame,range,domain,1,dbo:activeYearsStartDate,dbo:Politician,xsd:date,"What (xsd:date, X) is the active years start date/- of (dbo:Politician,Y?) ",SELECT ?X WHERE { Y dbo:activeYearsStartDate ?X.},FALSE,FALSE,"List the (xsd:date, X) - of (dbo:Politician,Y?) ",SELECT ?X WHERE { Y dbo:activeYearsStartDate ?X.},"the active years start date of (dbo:Politician,Y) ",,,